
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>生命周期 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="05_启动模式.html" />
    
    
    <link rel="prev" href="03_安装.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    runoob
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="01_sum.html">
            
                <a href="01_sum.html">
            
                    
                    sum
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="02_简介.html">
            
                <a href="02_简介.html">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="03_安装.html">
            
                <a href="03_安装.html">
            
                    
                    安装
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.4" data-path="04_生命周期.html">
            
                <a href="04_生命周期.html">
            
                    
                    生命周期
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="05_启动模式.html">
            
                <a href="05_启动模式.html">
            
                    
                    启动模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="06_创建版本库.html">
            
                <a href="06_创建版本库.html">
            
                    
                    创建版本库
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.7" data-path="07_检出操作.html">
            
                <a href="07_检出操作.html">
            
                    
                    检出操作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.8" data-path="08_解决冲突.html">
            
                <a href="08_解决冲突.html">
            
                    
                    解决冲突
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.9" data-path="09_提交操作.html">
            
                <a href="09_提交操作.html">
            
                    
                    提交操作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.10" data-path="10_版本回退.html">
            
                <a href="10_版本回退.html">
            
                    
                    版本回退
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.11" data-path="11_查看历史.html">
            
                <a href="11_查看历史.html">
            
                    
                    查看历史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.12" data-path="12_SVN分支.html">
            
                <a href="12_SVN分支.html">
            
                    
                    SVN分支
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.13" data-path="13_SVN标签.html">
            
                <a href="13_SVN标签.html">
            
                    
                    SVN标签
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.14" data-path="14_TortoiseSvn.html">
            
                <a href="14_TortoiseSvn.html">
            
                    
                    TortoiseSvn
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >生命周期</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="svn-&#x751F;&#x547D;&#x5468;&#x671F;">SVN &#x751F;&#x547D;&#x5468;&#x671F;</h1>
<p>&#x672C;&#x7AE0;&#x8BA8;&#x8BBA;&#x4E86;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x3002;</p>
<hr>
<h3 id="&#x521B;&#x5EFA;&#x7248;&#x672C;&#x5E93;">&#x521B;&#x5EFA;&#x7248;&#x672C;&#x5E93;</h3>
<p>&#x7248;&#x672C;&#x5E93;&#x76F8;&#x5F53;&#x4E8E;&#x4E00;&#x4E2A;&#x96C6;&#x4E2D;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x7528;&#x4E8E;&#x5B58;&#x653E;&#x5F00;&#x53D1;&#x8005;&#x6240;&#x6709;&#x7684;&#x5DE5;&#x4F5C;&#x6210;&#x679C;&#x3002;&#x7248;&#x672C;&#x5E93;&#x4E0D;&#x4EC5;&#x80FD;&#x5B58;&#x653E;&#x6587;&#x4EF6;&#xFF0C;&#x8FD8;&#x5305;&#x62EC;&#x4E86;&#x6BCF;&#x6B21;&#x4FEE;&#x6539;&#x7684;&#x5386;&#x53F2;&#xFF0C;&#x5373;&#x6BCF;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x53D8;&#x52A8;&#x5386;&#x53F2;&#x3002;</p>
<p>Create &#x64CD;&#x4F5C;&#x662F;&#x7528;&#x6765;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x7248;&#x672C;&#x5E93;&#x3002;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#x53EA;&#x4F1A;&#x6267;&#x884C;&#x4E00;&#x6B21;&#x3002;&#x5F53;&#x4F60;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x7248;&#x672C;&#x5E93;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x7684;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#x4F1A;&#x8BA9;&#x4F60;&#x63D0;&#x4F9B;&#x4E00;&#x4E9B;&#x4FE1;&#x606F;&#x6765;&#x6807;&#x8BC6;&#x7248;&#x672C;&#x5E93;&#xFF0C;&#x4F8B;&#x5982;&#x521B;&#x5EFA;&#x7684;&#x4F4D;&#x7F6E;&#x548C;&#x7248;&#x672C;&#x5E93;&#x7684;&#x540D;&#x5B57;&#x3002;</p>
<hr>
<h3 id="&#x68C0;&#x51FA;">&#x68C0;&#x51FA;</h3>
<p>Checkout &#x64CD;&#x4F5C;&#x662F;&#x7528;&#x6765;&#x4ECE;&#x7248;&#x672C;&#x5E93;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5DE5;&#x4F5C;&#x526F;&#x672C;&#x3002;&#x5DE5;&#x4F5C;&#x526F;&#x672C;&#x662F;&#x5F00;&#x53D1;&#x8005;&#x79C1;&#x4EBA;&#x7684;&#x5DE5;&#x4F5C;&#x7A7A;&#x95F4;&#xFF0C;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x5185;&#x5BB9;&#x7684;&#x4FEE;&#x6539;&#xFF0C;&#x7136;&#x540E;&#x63D0;&#x4EA4;&#x5230;&#x7248;&#x672C;&#x5E93;&#x4E2D;&#x3002;</p>
<hr>
<h3 id="&#x66F4;&#x65B0;">&#x66F4;&#x65B0;</h3>
<p>&#x987E;&#x540D;&#x601D;&#x4E49;&#xFF0C;update &#x64CD;&#x4F5C;&#x662F;&#x7528;&#x6765;&#x66F4;&#x65B0;&#x7248;&#x672C;&#x5E93;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#x5C06;&#x5DE5;&#x4F5C;&#x526F;&#x672C;&#x4E0E;&#x7248;&#x672C;&#x5E93;&#x8FDB;&#x884C;&#x540C;&#x6B65;&#x3002;&#x7531;&#x4E8E;&#x7248;&#x672C;&#x5E93;&#x662F;&#x7531;&#x6574;&#x4E2A;&#x56E2;&#x961F;&#x5171;&#x7528;&#x7684;&#xFF0C;&#x5F53;&#x5176;&#x4ED6;&#x4EBA;&#x63D0;&#x4EA4;&#x4E86;&#x4ED6;&#x4EEC;&#x7684;&#x6539;&#x52A8;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x7684;&#x5DE5;&#x4F5C;&#x526F;&#x672C;&#x5C31;&#x4F1A;&#x8FC7;&#x671F;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x5047;&#x8BBE; Tom &#x548C; Jerry &#x662F;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x4E24;&#x4E2A;&#x5F00;&#x53D1;&#x8005;&#x3002;&#x4ED6;&#x4EEC;&#x540C;&#x65F6;&#x4ECE;&#x7248;&#x672C;&#x5E93;&#x4E2D;&#x68C0;&#x51FA;&#x4E86;&#x6700;&#x65B0;&#x7684;&#x7248;&#x672C;&#x5E76;&#x5F00;&#x59CB;&#x5DE5;&#x4F5C;&#x3002;&#x6B64;&#x65F6;&#xFF0C;&#x5DE5;&#x4F5C;&#x526F;&#x672C;&#x662F;&#x4E0E;&#x7248;&#x672C;&#x5E93;&#x5B8C;&#x5168;&#x540C;&#x6B65;&#x7684;&#x3002;&#x7136;&#x540E;&#xFF0C;Jerry &#x5F88;&#x9AD8;&#x6548;&#x7684;&#x5B8C;&#x6210;&#x4E86;&#x4ED6;&#x7684;&#x5DE5;&#x4F5C;&#x5E76;&#x63D0;&#x4EA4;&#x4E86;&#x66F4;&#x6539;&#x5230;&#x7248;&#x672C;&#x5E93;&#x4E2D;&#x3002;</p>
<p>&#x6B64;&#x65F6; Tom &#x7684;&#x5DE5;&#x4F5C;&#x526F;&#x672C;&#x5C31;&#x8FC7;&#x671F;&#x4E86;&#x3002;&#x66F4;&#x65B0;&#x64CD;&#x4F5C;&#x5C06;&#x4F1A;&#x4ECE;&#x7248;&#x672C;&#x5E93;&#x4E2D;&#x62C9;&#x53D6; Jerry &#x7684;&#x6700;&#x65B0;&#x6539;&#x52A8;&#x5E76;&#x5C06; Tom &#x7684;&#x5DE5;&#x4F5C;&#x526F;&#x672C;&#x8FDB;&#x884C;&#x66F4;&#x65B0;&#x3002;</p>
<hr>
<h3 id="&#x6267;&#x884C;&#x53D8;&#x66F4;">&#x6267;&#x884C;&#x53D8;&#x66F4;</h3>
<p>&#x5F53;&#x68C0;&#x51FA;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x505A;&#x5F88;&#x591A;&#x64CD;&#x4F5C;&#x6765;&#x6267;&#x884C;&#x53D8;&#x66F4;&#x3002;&#x7F16;&#x8F91;&#x662F;&#x6700;&#x5E38;&#x7528;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x7F16;&#x8F91;&#x5DF2;&#x5B58;&#x5728;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x4F8B;&#x5982;&#x8FDB;&#x884C;&#x6587;&#x4EF6;&#x7684;&#x6DFB;&#x52A0;/&#x5220;&#x9664;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x6DFB;&#x52A0;&#x6587;&#x4EF6;/&#x76EE;&#x5F55;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x4E9B;&#x6DFB;&#x52A0;&#x7684;&#x6587;&#x4EF6;&#x76EE;&#x5F55;&#x4E0D;&#x4F1A;&#x7ACB;&#x523B;&#x6210;&#x4E3A;&#x7248;&#x672C;&#x5E93;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x800C;&#x662F;&#x88AB;&#x6DFB;&#x52A0;&#x8FDB;&#x5F85;&#x53D8;&#x66F4;&#x5217;&#x8868;&#x4E2D;&#xFF0C;&#x76F4;&#x5230;&#x6267;&#x884C;&#x4E86; commit &#x64CD;&#x4F5C;&#x540E;&#x624D;&#x4F1A;&#x6210;&#x4E3A;&#x7248;&#x672C;&#x5E93;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x540C;&#x6837;&#x5730;&#x4F60;&#x53EF;&#x4EE5;&#x5220;&#x9664;&#x6587;&#x4EF6;/&#x76EE;&#x5F55;&#x3002;&#x5220;&#x9664;&#x64CD;&#x4F5C;&#x7ACB;&#x523B;&#x5C06;&#x6587;&#x4EF6;&#x4ECE;&#x5DE5;&#x4F5C;&#x526F;&#x672C;&#x4E2D;&#x5220;&#x9664;&#x6389;&#xFF0C;&#x4F46;&#x8BE5;&#x6587;&#x4EF6;&#x7684;&#x5B9E;&#x9645;&#x5220;&#x9664;&#x53EA;&#x662F;&#x88AB;&#x6DFB;&#x52A0;&#x5230;&#x4E86;&#x5F85;&#x53D8;&#x66F4;&#x5217;&#x8868;&#x4E2D;&#xFF0C;&#x76F4;&#x5230;&#x6267;&#x884C;&#x4E86; commit &#x64CD;&#x4F5C;&#x540E;&#x624D;&#x4F1A;&#x771F;&#x6B63;&#x5220;&#x9664;&#x3002;</p>
<p>Rename &#x64CD;&#x4F5C;&#x53EF;&#x4EE5;&#x66F4;&#x6539;&#x6587;&#x4EF6;/&#x76EE;&#x5F55;&#x7684;&#x540D;&#x5B57;&#x3002;&quot;&#x79FB;&#x52A8;&quot;&#x64CD;&#x4F5C;&#x7528;&#x6765;&#x5C06;&#x6587;&#x4EF6;/&#x76EE;&#x5F55;&#x4ECE;&#x4E00;&#x5904;&#x79FB;&#x52A8;&#x5230;&#x7248;&#x672C;&#x5E93;&#x4E2D;&#x7684;&#x53E6;&#x4E00;&#x5904;&#x3002;</p>
<hr>
<h3 id="&#x590D;&#x67E5;&#x53D8;&#x5316;">&#x590D;&#x67E5;&#x53D8;&#x5316;</h3>
<p>&#x5F53;&#x4F60;&#x68C0;&#x51FA;&#x5DE5;&#x4F5C;&#x526F;&#x672C;&#x6216;&#x8005;&#x66F4;&#x65B0;&#x5DE5;&#x4F5C;&#x526F;&#x672C;&#x540E;&#xFF0C;&#x4F60;&#x7684;&#x5DE5;&#x4F5C;&#x526F;&#x672C;&#x5C31;&#x8DDF;&#x7248;&#x672C;&#x5E93;&#x5B8C;&#x5168;&#x540C;&#x6B65;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x5F53;&#x4F60;&#x5BF9;&#x5DE5;&#x4F5C;&#x526F;&#x672C;&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x4FEE;&#x6539;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x7684;&#x5DE5;&#x4F5C;&#x526F;&#x672C;&#x4F1A;&#x6BD4;&#x7248;&#x672C;&#x5E93;&#x8981;&#x65B0;&#x3002;&#x5728; commit &#x64CD;&#x4F5C;&#x4E4B;&#x524D;&#x590D;&#x67E5;&#x4E0B;&#x4F60;&#x7684;&#x4FEE;&#x6539;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x4E60;&#x60EF;&#x3002;</p>
<p>Status &#x64CD;&#x4F5C;&#x5217;&#x51FA;&#x4E86;&#x5DE5;&#x4F5C;&#x526F;&#x672C;&#x4E2D;&#x6240;&#x8FDB;&#x884C;&#x7684;&#x53D8;&#x52A8;&#x3002;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x63D0;&#x5230;&#x7684;&#xFF0C;&#x4F60;&#x5BF9;&#x5DE5;&#x4F5C;&#x526F;&#x672C;&#x7684;&#x4EFB;&#x4F55;&#x6539;&#x52A8;&#x90FD;&#x4F1A;&#x6210;&#x4E3A;&#x5F85;&#x53D8;&#x66F4;&#x5217;&#x8868;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;Status &#x64CD;&#x4F5C;&#x5C31;&#x662F;&#x7528;&#x6765;&#x67E5;&#x770B;&#x8FD9;&#x4E2A;&#x5F85;&#x53D8;&#x66F4;&#x5217;&#x8868;&#x3002;</p>
<p>Status &#x64CD;&#x4F5C;&#x53EA;&#x662F;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x53D8;&#x52A8;&#x5217;&#x8868;&#xFF0C;&#x4F46;&#x5E76;&#x4E0D;&#x63D0;&#x4F9B;&#x53D8;&#x52A8;&#x7684;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x7528; diff &#x64CD;&#x4F5C;&#x6765;&#x67E5;&#x770B;&#x8FD9;&#x4E9B;&#x53D8;&#x52A8;&#x7684;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x3002;</p>
<hr>
<h3 id="&#x4FEE;&#x590D;&#x9519;&#x8BEF;">&#x4FEE;&#x590D;&#x9519;&#x8BEF;</h3>
<p>&#x6211;&#x4EEC;&#x6765;&#x5047;&#x8BBE;&#x4F60;&#x5BF9;&#x5DE5;&#x4F5C;&#x526F;&#x672C;&#x505A;&#x4E86;&#x8BB8;&#x591A;&#x4FEE;&#x6539;&#xFF0C;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x4F60;&#x4E0D;&#x60F3;&#x8981;&#x8FD9;&#x4E9B;&#x4FEE;&#x6539;&#x4E86;&#xFF0C;&#x8FD9;&#x65F6;&#x5019; revert &#x64CD;&#x4F5C;&#x5C06;&#x4F1A;&#x5E2E;&#x52A9;&#x4F60;&#x3002;</p>
<p>Revert &#x64CD;&#x4F5C;&#x91CD;&#x7F6E;&#x4E86;&#x5BF9;&#x5DE5;&#x4F5C;&#x526F;&#x672C;&#x7684;&#x4FEE;&#x6539;&#x3002;&#x5B83;&#x53EF;&#x4EE5;&#x91CD;&#x7F6E;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x6587;&#x4EF6;/&#x76EE;&#x5F55;&#x3002;&#x5F53;&#x7136;&#x5B83;&#x4E5F;&#x53EF;&#x4EE5;&#x91CD;&#x7F6E;&#x6574;&#x4E2A;&#x5DE5;&#x4F5C;&#x526F;&#x672C;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;revert &#x64CD;&#x4F5C;&#x5C06;&#x4F1A;&#x9500;&#x6BC1;&#x5F85;&#x53D8;&#x66F4;&#x5217;&#x8868;&#x5E76;&#x5C06;&#x5DE5;&#x4F5C;&#x526F;&#x672C;&#x6062;&#x590D;&#x5230;&#x539F;&#x59CB;&#x72B6;&#x6001;&#x3002;</p>
<hr>
<h3 id="&#x89E3;&#x51B3;&#x51B2;&#x7A81;">&#x89E3;&#x51B3;&#x51B2;&#x7A81;</h3>
<p>&#x5408;&#x5E76;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;&#x51B2;&#x7A81;&#x3002;Merge &#x64CD;&#x4F5C;&#x4F1A;&#x81EA;&#x52A8;&#x5904;&#x7406;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x5408;&#x5E76;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x5176;&#x5B83;&#x7684;&#x4F1A;&#x88AB;&#x5F53;&#x505A;&#x51B2;&#x7A81;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&quot;hello.c&quot; &#x6587;&#x4EF6;&#x5728;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#x4E0A;&#x88AB;&#x4FEE;&#x6539;&#xFF0C;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#x4E0A;&#x88AB;&#x5220;&#x9664;&#x4E86;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5C31;&#x9700;&#x8981;&#x4EBA;&#x4E3A;&#x5904;&#x7406;&#x3002;Resolve &#x64CD;&#x4F5C;&#x5C31;&#x662F;&#x7528;&#x6765;&#x5E2E;&#x52A9;&#x7528;&#x6237;&#x627E;&#x51FA;&#x51B2;&#x7A81;&#x5E76;&#x544A;&#x8BC9;&#x7248;&#x672C;&#x5E93;&#x5982;&#x4F55;&#x5904;&#x7406;&#x8FD9;&#x4E9B;&#x51B2;&#x7A81;&#x3002;</p>
<hr>
<h3 id="&#x63D0;&#x4EA4;&#x66F4;&#x6539;">&#x63D0;&#x4EA4;&#x66F4;&#x6539;</h3>
<p>Commit &#x64CD;&#x4F5C;&#x662F;&#x7528;&#x6765;&#x5C06;&#x66F4;&#x6539;&#x4ECE;&#x5DE5;&#x4F5C;&#x526F;&#x672C;&#x5230;&#x7248;&#x672C;&#x5E93;&#x3002;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#x4F1A;&#x4FEE;&#x6539;&#x7248;&#x672C;&#x5E93;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5176;&#x5B83;&#x5F00;&#x53D1;&#x8005;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x66F4;&#x65B0;&#x4ED6;&#x4EEC;&#x7684;&#x5DE5;&#x4F5C;&#x526F;&#x672C;&#x6765;&#x67E5;&#x770B;&#x8FD9;&#x4E9B;&#x4FEE;&#x6539;&#x3002;</p>
<p>&#x5728;&#x63D0;&#x4EA4;&#x4E4B;&#x524D;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x5C06;&#x6587;&#x4EF6;/&#x76EE;&#x5F55;&#x6DFB;&#x52A0;&#x5230;&#x5F85;&#x53D8;&#x66F4;&#x5217;&#x8868;&#x4E2D;&#x3002;&#x5217;&#x8868;&#x4E2D;&#x8BB0;&#x5F55;&#x4E86;&#x5C06;&#x4F1A;&#x88AB;&#x63D0;&#x4EA4;&#x7684;&#x6539;&#x52A8;&#x3002;&#x5F53;&#x63D0;&#x4EA4;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x4F1A;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x6CE8;&#x91CA;&#x6765;&#x8BF4;&#x660E;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x8FDB;&#x884C;&#x8FD9;&#x4E9B;&#x6539;&#x52A8;&#x3002;&#x8FD9;&#x4E2A;&#x6CE8;&#x91CA;&#x4E5F;&#x4F1A;&#x6210;&#x4E3A;&#x7248;&#x672C;&#x5E93;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;Commit &#x662F;&#x4E00;&#x4E2A;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x8981;&#x4E48;&#x5B8C;&#x5168;&#x63D0;&#x4EA4;&#x6210;&#x529F;&#xFF0C;&#x8981;&#x4E48;&#x5931;&#x8D25;&#x56DE;&#x6EDA;&#x3002;&#x7528;&#x6237;&#x4E0D;&#x4F1A;&#x770B;&#x5230;&#x6210;&#x529F;&#x63D0;&#x4EA4;&#x4E00;&#x534A;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="03_安装.html" class="navigation navigation-prev " aria-label="Previous page: 安装">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="05_启动模式.html" class="navigation navigation-next " aria-label="Next page: 启动模式">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"生命周期","level":"1.2.4","depth":2,"next":{"title":"启动模式","level":"1.2.5","depth":2,"path":"runoob/05_启动模式.md","ref":"./runoob/05_启动模式.md","articles":[]},"previous":{"title":"安装","level":"1.2.3","depth":2,"path":"runoob/03_安装.md","ref":"./runoob/03_安装.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"runoob/04_生命周期.md","mtime":"2020-09-03T07:38:45.900Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-09-03T08:36:31.797Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

