
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>TCP中的拥塞控制和流量控制 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../4_物理层/" />
    
    
    <link rel="prev" href="../2_https和http/" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    README.md
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../1_三次握手和四次挥手/">
            
                <a href="../1_三次握手和四次挥手/">
            
                    
                    三次握手和四次挥手
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../2_https和http/">
            
                <a href="../2_https和http/">
            
                    
                    https和http
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="./">
            
                <a href="./">
            
                    
                    TCP中的拥塞控制和流量控制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../4_物理层/">
            
                <a href="../4_物理层/">
            
                    
                    物理层
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../5_数据链路层/">
            
                <a href="../5_数据链路层/">
            
                    
                    数据链路层
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="../6_http中的状态码/">
            
                <a href="../6_http中的状态码/">
            
                    
                    http中的状态码
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >TCP中的拥塞控制和流量控制</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="tcp&#x4E2D;&#x7684;&#x6D41;&#x91CF;&#x63A7;&#x5236;&#x548C;&#x62E5;&#x585E;&#x63A7;&#x5236;">TCP&#x4E2D;&#x7684;&#x6D41;&#x91CF;&#x63A7;&#x5236;&#x548C;&#x62E5;&#x585E;&#x63A7;&#x5236;</h1>
<h2 id="&#x6D41;&#x91CF;&#x63A7;&#x5236;">&#x6D41;&#x91CF;&#x63A7;&#x5236;</h2>
<h3 id="&#x4EC0;&#x4E48;&#x662F;&#x6D41;&#x91CF;&#x63A7;&#x5236;">&#x4EC0;&#x4E48;&#x662F;&#x6D41;&#x91CF;&#x63A7;&#x5236;</h3>
<p>&#x5982;&#x679C;&#x53D1;&#x9001;&#x8005;&#x53D1;&#x9001;&#x6570;&#x636E;&#x8FC7;&#x5FEB;&#xFF0C;&#x63A5;&#x6536;&#x8005;&#x6765;&#x4E0D;&#x53CA;&#x63A5;&#x6536;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4F1A;&#x51FA;&#x73B0;&#x5206;&#x7EC4;&#x4E22;&#x5931;&#xFF0C;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x5206;&#x7EC4;&#x4E22;&#x5931;&#xFF0C;&#x63A7;&#x5236;&#x53D1;&#x9001;&#x8005;&#x7684;&#x53D1;&#x9001;&#x901F;&#x5EA6;&#xFF0C;&#x4F7F;&#x5F97;&#x63A5;&#x6536;&#x8005;&#x6765;&#x5F97;&#x53CA;&#x63A5;&#x6536;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6D41;&#x91CF;&#x63A7;&#x5236;&#x3002;</p>
<p>&#x6D41;&#x91CF;&#x63A7;&#x5236;&#x7684;&#x76EE;&#x7684;&#x662F;&#xFF1A;&#x9632;&#x6B62;&#x5206;&#x7EC4;&#x4E22;&#x5931;&#xFF0C;&#x662F;&#x6784;&#x6210;TCP&#x53EF;&#x9760;&#x6027;&#x7684;&#x4E00;&#x65B9;&#x9762;&#x3002;</p>
<h3 id="&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x6D41;&#x91CF;&#x63A7;&#x5236;">&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x6D41;&#x91CF;&#x63A7;&#x5236;</h3>
<p>&#x7531;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x534F;&#x8BAE;&#xFF08;&#x8FDE;&#x7EED;ARQ&#x534F;&#x8BAE;&#xFF09;&#x5B9E;&#x73B0;&#xFF0C;&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x534F;&#x8BAE;&#x5373;&#x4FDD;&#x8BC1;&#x4E86;&#x5206;&#x7EC4;&#x65E0;&#x5DEE;&#x9519;&#xFF0C;&#x6709;&#x5E8F;&#x63A5;&#x6536;&#xFF0C;&#x4E5F;&#x5B9E;&#x73B0;&#x4E86;&#x6D41;&#x91CF;&#x63A7;&#x5236;&#x3002;&#x4E3B;&#x8981;&#x7684;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x63A5;&#x6536;&#x65B9;&#x8FD4;&#x56DE;&#x7684;ACK&#x4F1A;&#x5305;&#x542B;&#x81EA;&#x5DF1;&#x7684;&#x63A5;&#x53D7;&#x7A97;&#x53E3;&#x5927;&#x5C0F;&#xFF0C;&#x5E76;&#x5229;&#x7528;&#x5927;&#x5C0F;&#x6765;&#x63A7;&#x5236;&#x53D1;&#x9001;&#x65B9;&#x7684;&#x6570;&#x636E;&#x53D1;&#x9001;&#x3002;</p>
<h2 id="&#x62E5;&#x585E;&#x63A7;&#x5236;">&#x62E5;&#x585E;&#x63A7;&#x5236;</h2>
<h3 id="&#x4EC0;&#x4E48;&#x662F;&#x62E5;&#x585E;&#x63A7;&#x5236;">&#x4EC0;&#x4E48;&#x662F;&#x62E5;&#x585E;&#x63A7;&#x5236;</h3>
<p>&#x62E5;&#x585E;&#x63A7;&#x5236;&#x662F;&#x4F5C;&#x7528;&#x4E8E;&#x7F51;&#x7EDC;&#x7684;&#xFF0C;&#x5B83;&#x662F;&#x9632;&#x6B62;&#x8FC7;&#x591A;&#x7684;&#x6570;&#x636E;&#x6CE8;&#x5165;&#x7F51;&#x7EDC;&#xFF0C;&#x907F;&#x514D;&#x51FA;&#x73B0;&#x7F51;&#x7EDC;&#x8D1F;&#x8F7D;&#x8FC7;&#x5927;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5E38;&#x89C1;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;</p>
<ul>
<li>&#x6162;&#x5F00;&#x59CB;&#xFF0C;&#x907F;&#x514D;&#x62E5;&#x585E;</li>
<li>&#x5FEB;&#x91CD;&#x4F20;&#x3001;&#x5FEB;&#x6062;&#x590D;</li>
</ul>
<h3 id="&#x62E5;&#x585E;&#x63A7;&#x5236;&#x7B97;&#x6CD5;">&#x62E5;&#x585E;&#x63A7;&#x5236;&#x7B97;&#x6CD5;</h3>
<p>&#x6211;&#x4EEC;&#x9996;&#x5148;&#x6DFB;&#x52A0;&#x51E0;&#x4E2A;&#x9650;&#x5B9A;&#x6761;&#x4EF6;</p>
<ul>
<li>&#x6570;&#x636E;&#x662F;&#x5355;&#x65B9;&#x5411;&#x4F20;&#x9012;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x7A97;&#x53E3;&#x53EA;&#x53D1;&#x9001;&#x786E;&#x8BA4;</li>
<li>&#x63A5;&#x6536;&#x65B9;&#x7684;&#x7F13;&#x5B58;&#x8DB3;&#x591F;&#x5927;&#xFF0C;&#x56E0;&#x6B64;&#x53D1;&#x9001;&#x65B9;&#x7684;&#x5927;&#x5C0F;&#x7531;&#x7F51;&#x7EDC;&#x7684;&#x62E5;&#x585E;&#x7A0B;&#x5EA6;&#x6765;&#x51B3;&#x5B9A;</li>
</ul>
<h4 id="&#x6162;&#x5F00;&#x59CB;&#x7B97;&#x6CD5;">&#x6162;&#x5F00;&#x59CB;&#x7B97;&#x6CD5;</h4>
<p>&#x53D1;&#x9001;&#x65B9;&#x7EF4;&#x6301;&#x4E00;&#x4E2A;&#x53EB;&#x505A;&#x62E5;&#x585E;&#x7A97;&#x53E3;cwnd&#xFF08;congestion window&#xFF09;&#x7684;&#x72B6;&#x6001;&#x53D8;&#x91CF;&#xFF0C;&#x62E5;&#x585E;&#x7A97;&#x53E3;&#x7684;&#x5927;&#x5C0F;&#x53D6;&#x51B3;&#x4E8E;&#x7F51;&#x7EDC;&#x7684;&#x62E5;&#x585E;&#x7A0B;&#x5EA6;&#xFF0C;&#x5E76;&#x4E14;&#x52A8;&#x6001;&#x5730;&#x5728;&#x53D8;&#x5316;&#xFF0C;&#x53D1;&#x9001;&#x65B9;&#x8BA9;&#x81EA;&#x5DF1;&#x7684;&#x53D1;&#x9001;&#x7A97;&#x53E3;&#x7B49;&#x4E8E;&#x62E5;&#x585E;&#x7A97;&#x53E3;&#xFF0C;&#x53E6;&#x5916;&#x8003;&#x8651;&#x5230;&#x63A5;&#x6536;&#x65B9;&#x7684;&#x63A5;&#x53D7;&#x80FD;&#x529B;&#xFF0C;&#x53D1;&#x9001;&#x7A97;&#x53E3;&#x53EF;&#x80FD;&#x5C0F;&#x4E8E;&#x62E5;&#x585E;&#x7A97;&#x53E3;&#x3002;</p>
<p>&#x6162;&#x5F00;&#x59CB;&#x7B97;&#x6CD5;&#x7684;&#x601D;&#x8DEF;&#x5C31;&#x662F;&#xFF1A;&#x4E0D;&#x8981;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x53D1;&#x9001;&#x5927;&#x91CF;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5148;&#x6D4B;&#x63A2;&#x4E00;&#x4E0B;&#x7F51;&#x7EDC;&#x7684;&#x62E5;&#x585E;&#x7A0B;&#x5EA6;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x4ECE;&#x5C0F;&#x5230;&#x5927;&#x4E3B;&#x952E;&#x589E;&#x52A0;&#x62E5;&#x585E;&#x7A97;&#x53E3;&#x7684;&#x5927;&#x5C0F;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x7528;&#x62A5;&#x6587;&#x6BB5;&#x7684;&#x4E2A;&#x6570;&#x4F5C;&#x4E3A;&#x62E5;&#x585E;&#x7A97;&#x53E3;&#x7684;&#x5927;&#x5C0F;&#x4E3E;&#x4F8B;&#x8BF4;&#x660E;&#x6162;&#x5F00;&#x59CB;&#x7B97;&#x6CD5;&#xFF0C;&#x5B9E;&#x9645;&#x7684;&#x62E5;&#x585E;&#x7A97;&#x53E3;&#x5927;&#x5C0F;&#x662F;&#x4EE5;&#x5B57;&#x8282;&#x4E3A;&#x5355;&#x4F4D;&#x7684;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="images/image-20200623214100440.png" alt="image-20200623214100440"></p>
<blockquote>
<p>&#x53D1;&#x9001;&#x65B9;&#x6CA1;&#x6536;&#x5230;&#x4E00;&#x4E2A;&#x786E;&#x8BA4;&#x7A97;&#x53E3;&#xFF0C;&#x5C31;&#x628A;&#x7A97;&#x53E3;cwnd&#x52A0;1</p>
</blockquote>
<p>&#x4ECE;&#x4E0A;&#x56FE;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x4E00;&#x4E2A;&#x4F20;&#x8F93;&#x8F6E;&#x6B21;&#x6240;&#x7ECF;&#x5386;&#x7684;&#x65F6;&#x95F4;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x5F80;&#x8FD4;&#x65F6;&#x95F4;RTT&#xFF0C;&#x800C;&#x4E14;&#x6BCF;&#x7ECF;&#x8FC7;&#x4E00;&#x4E2A;&#x4F20;&#x8F93;&#x8F6E;&#x6B21;&#xFF0C;&#x62E5;&#x585E;&#x7A97;&#x53E3;cwnd&#x5C31;&#x52A0;&#x500D;</p>
<p>&#x4E3A;&#x4E86;&#x9632;&#x6B62;cwnd&#x589E;&#x957F;&#x8FC7;&#x5927;&#x5F15;&#x8D77;&#x7F51;&#x7EDC;&#x62E5;&#x585E;&#xFF0C;&#x8FD8;&#x9700;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x6162;&#x5F00;&#x59CB;&#x95E8;&#x9650;ssthresh&#x72B6;&#x6001;&#x53D8;&#x91CF;&#xFF0C;ssthresh&#x7684;&#x7528;&#x6CD5;&#x5982;&#x4E0B;&#xFF1A;</p>
<ul>
<li>&#x5F53; cwnd &gt; ssthresh&#x65F6;&#xFF1A;&#x4F7F;&#x7528;&#x6162;&#x5F00;&#x59CB;&#x7B97;&#x6CD5;</li>
<li>&#x5F53;cwnd = ssthresh&#x65F6;&#xFF1A;&#x91C7;&#x7528; &#x6162;&#x5F00;&#x59CB;&#x6216;&#x62E5;&#x585E;&#x907F;&#x514D;&#x4E2D;&#x7684;&#x4EFB;&#x610F;&#x4E00;&#x79CD;</li>
<li>&#x5F53; cwnd &gt; ssthresh&#x65F6;&#xFF1A;&#x91C7;&#x7528;&#x62E5;&#x585E;&#x907F;&#x514D;&#x7B97;&#x6CD5;</li>
</ul>
<h4 id="&#x62E5;&#x585E;&#x907F;&#x514D;&#x7B97;&#x6CD5;">&#x62E5;&#x585E;&#x907F;&#x514D;&#x7B97;&#x6CD5;</h4>
<p>&#x62E5;&#x585E;&#x907F;&#x514D;&#x7B97;&#x6CD5;&#x8BA9;&#x62E5;&#x585E;&#x7A97;&#x53E3;&#x7F13;&#x6162;&#x589E;&#x957F;&#xFF0C;&#x5373;&#x6CA1;&#x7ECF;&#x8FC7;&#x4E00;&#x4E2A;&#x5F80;&#x8FD4;&#x65F6;&#x95F4;RTT&#x5C31;&#x628A;&#x53D1;&#x9001;&#x65B9;&#x7684;&#x62E5;&#x585E;&#x7A97;&#x53E3;cwnd&#x52A0;1&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x52A0;&#x500D;&#xFF0C;&#x8FD9;&#x6837;&#x80FD;&#x591F;&#x8BA9;&#x62E5;&#x585E;&#x7A97;&#x53E3;&#x6309;&#x7EBF;&#x6027;&#x89C4;&#x5F8B;&#x589E;&#x957F;&#x3002;</p>
<p>&#x65E0;&#x8BBA;&#x662F;&#x5728;&#x6162;&#x5F00;&#x59CB;&#x9636;&#x6BB5;&#xFF0C;&#x8FD8;&#x662F;&#x5728;&#x62E5;&#x585E;&#x63A7;&#x5236;&#x9636;&#x6BB5;&#xFF0C;&#x53EA;&#x8981;&#x53D1;&#x9001;&#x65B9;&#x5224;&#x65AD;&#x7F51;&#x7EDC;&#x51FA;&#x73B0;&#x62E5;&#x585E;&#xFF0C;&#x5C31;&#x628A;&#x6162;&#x5F00;&#x59CB;&#x95E8;&#x9650; ssthressh&#x8BBE;&#x7F6E;&#x4E3A;&#x5F53;&#x524D;&#x51FA;&#x73B0;&#x62E5;&#x585E;&#x65F6;&#x53D1;&#x9001;&#x7A97;&#x53E3;&#x5927;&#x5C0F;&#x7684;&#x4E00;&#x534A;&#xFF08;&#x4E0D;&#x80FD;&#x5C0F;&#x4E8E;2&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x62E5;&#x585E;&#x7A97;&#x53E3;cwnd&#x8BBE;&#x7F6E;&#x4E3A;1&#xFF0C;&#x6267;&#x884C;&#x6162;&#x5F00;&#x59CB;&#x7B97;&#x6CD5;&#x3002;</p>
<p>&#x8FD9;&#x6837;&#x505A;&#x7684;&#x76EE;&#x7684;&#x662F;&#x8FC5;&#x901F;&#x51CF;&#x5C11;&#x4E3B;&#x673A;&#x53D1;&#x9001;&#x5230;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x5206;&#x7EC4;&#x6570;&#xFF0C;&#x4F7F;&#x5F97;&#x53D1;&#x9001;&#x62E5;&#x585E;&#x7684;&#x8DEF;&#x7531;&#x5668;&#x6709;&#x8DB3;&#x591F;&#x65F6;&#x95F4;&#x628A;&#x961F;&#x5217;&#x4E2D;&#x79EF;&#x538B;&#x7684;&#x5206;&#x7EC4;&#x5904;&#x7406;&#x5B8C;&#x6BD5;&#x3002;</p>
<p>&#x6574;&#x4E2A;&#x62E5;&#x585E;&#x63A7;&#x5236;&#x7684;&#x6D41;&#x7A0B;&#x56FE;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="images/image-20200623220009542.png" alt="image-20200623220009542"></p>
<ul>
<li>&#x62E5;&#x585E;&#x7A97;&#x53E3;cwnd&#x521D;&#x59CB;&#x5316;&#x4E3A;1&#x4E2A;&#x62A5;&#x6587;&#x6BB5;&#xFF0C;&#x6162;&#x5F00;&#x59CB;&#x95E8;&#x9650;&#x521D;&#x59CB;&#x503C;&#x4E3A;16</li>
<li>&#x6267;&#x884C;&#x6162;&#x5F00;&#x59CB;&#x7B97;&#x6CD5;&#xFF0C;&#x6307;&#x6570;&#x89C4;&#x5F8B;&#x589E;&#x957F;&#x5230;&#x7B2C;4&#x8F6E;&#xFF0C;&#x5373;cwnd=16=ssthresh&#xFF0C;&#x6539;&#x4E3A;&#x6267;&#x884C;&#x62E5;&#x585E;&#x907F;&#x514D;&#x7B97;&#x6CD5;&#xFF0C;&#x62E5;&#x585E;&#x7A97;&#x53E3;&#x6309;&#x7EBF;&#x6027;&#x89C4;&#x5F8B;&#x589E;&#x957F;</li>
<li>&#x5047;&#x5B9A;cwnd=24&#x65F6;&#xFF0C;&#x7F51;&#x7EDC;&#x51FA;&#x73B0;&#x8D85;&#x65F6;&#xFF08;&#x62E5;&#x585E;&#xFF09;&#xFF0C;&#x5219;&#x66F4;&#x65B0;&#x540E;&#x7684;ssthresh=12&#xFF0C;cwnd&#x91CD;&#x65B0;&#x8BBE;&#x7F6E;&#x4E3A;1&#xFF0C;&#x5E76;&#x6267;&#x884C;&#x6162;&#x5F00;&#x59CB;&#x7B97;&#x6CD5;&#x3002;&#x5F53;cwnd=12=ssthresh&#x65F6;&#xFF0C;&#x6539;&#x4E3A;&#x6267;&#x884C;&#x62E5;&#x585E;&#x907F;&#x514D;&#x7B97;&#x6CD5;</li>
</ul>
<p><strong>&#x4E58;&#x6CD5;&#x51CF;&#x5C0F;&#x548C;&#x52A0;&#x6CD5;&#x589E;&#x5927;</strong></p>
<ul>
<li>&#x4E58;&#x6CD5;&#x51CF;&#x5C0F;&#x201D;&#x6307;&#x7684;&#x662F;&#x65E0;&#x8BBA;&#x662F;&#x5728;&#x6162;&#x5F00;&#x59CB;&#x9636;&#x6BB5;&#x8FD8;&#x662F;&#x5728;&#x62E5;&#x585E;&#x907F;&#x514D;&#x9636;&#x6BB5;&#xFF0C;&#x53EA;&#x8981;&#x53D1;&#x9001;&#x65B9;&#x5224;&#x65AD;&#x7F51;&#x7EDC;&#x51FA;&#x73B0;&#x62E5;&#x585E;&#xFF0C;&#x5C31;&#x628A;&#x6162;&#x5F00;&#x59CB;&#x95E8;&#x9650;ssthresh&#x8BBE;&#x7F6E;&#x4E3A;&#x51FA;&#x73B0;&#x62E5;&#x585E;&#x65F6;&#x7684;&#x53D1;&#x9001;&#x7A97;&#x53E3;&#x5927;&#x5C0F;&#x7684;&#x4E00;&#x534A;&#xFF0C;&#x5E76;&#x6267;&#x884C;&#x6162;&#x5F00;&#x59CB;&#x7B97;&#x6CD5;&#xFF0C;&#x6240;&#x4EE5;&#x5F53;&#x7F51;&#x7EDC;&#x9891;&#x7E41;&#x51FA;&#x73B0;&#x62E5;&#x585E;&#x65F6;&#xFF0C;ssthresh&#x4E0B;&#x964D;&#x7684;&#x5F88;&#x5FEB;&#xFF0C;&#x4EE5;&#x5927;&#x5927;&#x51CF;&#x5C11;&#x6CE8;&#x5165;&#x5230;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x5206;&#x7EC4;&#x6570;&#x3002;</li>
<li>&#x52A0;&#x6CD5;&#x589E;&#x5927;&#x201D;&#x662F;&#x6307;&#x6267;&#x884C;&#x62E5;&#x585E;&#x907F;&#x514D;&#x7B97;&#x6CD5;&#x540E;&#xFF0C;&#x4F7F;&#x62E5;&#x585E;&#x7A97;&#x53E3;&#x7F13;&#x6162;&#x589E;&#x5927;&#xFF0C;&#x4EE5;&#x9632;&#x6B62;&#x8FC7;&#x65E9;&#x51FA;&#x73B0;&#x62E5;&#x585E;&#x3002;&#x5E38;&#x5408;&#x8D77;&#x6765;&#x6210;&#x4E3A;AIMD&#x7B97;&#x6CD5;&#x3002;</li>
</ul>
<h4 id="&#x5FEB;&#x91CD;&#x4F20;&#x7B97;&#x6CD5;">&#x5FEB;&#x91CD;&#x4F20;&#x7B97;&#x6CD5;</h4>
<p>&#x5FEB;&#x91CD;&#x4F20;&#x8981;&#x6C42;&#x63A5;&#x6536;&#x65B9;&#x5728;&#x6536;&#x5230;&#x4E00;&#x4E2A;&#x5931;&#x5E8F;&#x7684;&#x62A5;&#x6587;&#x6BB5;&#x540E;&#xFF0C;&#x5C31;&#x7ACB;&#x5373;&#x53D1;&#x51FA;&#x91CD;&#x590D;&#x786E;&#x5B9A;&#xFF08;&#x4E3A;&#x7684;&#x662F;&#x4F7F;&#x53D1;&#x9001;&#x65B9;&#x53CA;&#x65E9;&#x77E5;&#x9053;&#x6709;&#x62A5;&#x6587;&#x6BB5;&#x6CA1;&#x6709;&#x8FBE;&#x5230;&#x5BF9;&#x65B9;&#xFF0C;&#x53EF;&#x63D0;&#x9AD8;&#x7F51;&#x7EDC;&#x541E;&#x5410;&#x91CF;&#x7EA6;20%&#xFF09;&#x800C;&#x4E0D;&#x8981;&#x7B49;&#x5230;&#x81EA;&#x5DF1;&#x53D1;&#x9001;&#x6570;&#x636E;&#x65F6;&#x634E;&#x5E26;&#x786E;&#x5B9A;&#x3002;&#x5FEB;&#x91CD;&#x4F20;&#x7B97;&#x6CD5;&#x89C4;&#x5B9A;&#xFF0C;&#x53D1;&#x9001;&#x65B9;&#x53EA;&#x8981;&#x4E00;&#x8FDE;&#x6536;&#x5230;&#x4E09;&#x4E2A;&#x91CD;&#x590D;&#x786E;&#x5B9A;&#x5C31;&#x5E94;&#x5F53;&#x7ACB;&#x5373;&#x91CD;&#x4F20;&#x5BF9;&#x65B9;&#x5C1A;&#x4E3A;&#x6536;&#x5230;&#x7684;&#x62A5;&#x6587;&#x6BB5;&#xFF0C;&#x800C;&#x4E0D;&#x5FC5;&#x7EE7;&#x7EED;&#x7B49;&#x5F85;&#x8BBE;&#x7F6E;&#x7684;&#x91CD;&#x4F20;&#x8BA1;&#x65F6;&#x5668;&#x65F6;&#x95F4;&#x5230;&#x671F;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;</p>
<p><img src="images/image-20200623221705052.png" alt="image-20200623221705052"></p>
<h4 id="&#x5FEB;&#x6062;&#x590D;">&#x5FEB;&#x6062;&#x590D;</h4>
<p>&#x5FEB;&#x91CD;&#x4F20;&#x914D;&#x5408;&#x4F7F;&#x7528;&#x7684;&#x8FD8;&#x6709;&#x5FEB;&#x6062;&#x590D;&#x7B97;&#x6CD5;&#xFF0C;&#x6709;&#x4EE5;&#x4E0B;&#x4E24;&#x70B9;&#x8981;&#x6C42;</p>
<ul>
<li>&#x5F53;&#x53D1;&#x9001;&#x65B9;&#x8FDE;&#x7EED;&#x6536;&#x5230;&#x4E09;&#x4E2A;&#x91CD;&#x590D;&#x786E;&#x8BA4;&#x65F6;&#xFF0C;&#x5C31;&#x6267;&#x884C;&#x4E58;&#x6CD5;&#x51CF;&#x5C0F;&#x7B97;&#x6CD5;&#xFF0C;&#x628A;ssthresh&#x95E8;&#x9650;&#x51CF;&#x534A;&#xFF08;&#x4E3A;&#x4E86;&#x9884;&#x9632;&#x53D1;&#x9001;&#x62E5;&#x585E;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x63A5;&#x4E0B;&#x6765;&#x5E76;&#x4E0D;&#x6267;&#x884C;&#x6162;&#x5F00;&#x59CB;&#x7B97;&#x6CD5;</li>
<li>&#x8003;&#x8651;&#x5230;&#x5982;&#x679C;&#x7F51;&#x7EDC;&#x51FA;&#x73B0;&#x62E5;&#x585E;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x4E0D;&#x4F1A;&#x6536;&#x5230;&#x597D;&#x51E0;&#x4E2A;&#x91CD;&#x590D;&#x7684;&#x786E;&#x8BA4;&#xFF0C;&#x6240;&#x4EE5;&#x53D1;&#x9001;&#x65B9;&#x73B0;&#x5728;&#x8BA4;&#x4E3A;&#x7F51;&#x7EDC;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x51FA;&#x73B0;&#x62E5;&#x585E;&#xFF0C;&#x6240;&#x4EE5;&#x6B64;&#x65F6;&#x4E0D;&#x6267;&#x884C;&#x6162;&#x5F00;&#x59CB;&#x7B97;&#x6CD5;&#xFF0C;&#x800C;&#x662F;&#x5C06;cwnd&#x8BBE;&#x7F6E;&#x4E3A;ssthresh&#x51CF;&#x534A;&#x540E;&#x7684;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x6267;&#x884C;&#x62E5;&#x585E;&#x907F;&#x514D;&#x7B97;&#x6CD5;&#xFF0C;&#x4F7F;cwnd&#x7F13;&#x6162;&#x589E;&#x5927;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;TCP Reno&#x7248;&#x672C;&#x662F;&#x76EE;&#x524D;&#x4F7F;&#x7528;&#x6700;&#x5E7F;&#x6CDB;&#x7684;&#x7248;&#x672C;&#x3002;</li>
</ul>
<p><img src="images/image-20200623222155538.png" alt="image-20200623222155538"></p>
<blockquote>
<p>&#x5728;&#x91C7;&#x7528;&#x5FEB;&#x6062;&#x590D;&#x7B97;&#x6CD5;&#x65F6;&#xFF0C;&#x6162;&#x5F00;&#x59CB;&#x7B97;&#x6CD5;&#x53EA;&#x662F;&#x5728;TCP&#x8FDE;&#x63A5;&#x5EFA;&#x7ACB;&#x65F6;&#x548C;&#x7F51;&#x7EDC;&#x51FA;&#x73B0;&#x8D85;&#x65F6;&#x65F6;&#x624D;&#x4F7F;&#x7528;</p>
</blockquote>
<h2 id="&#x6765;&#x6E90;">&#x6765;&#x6E90;</h2>
<p><a href="https://zhuanlan.zhihu.com/p/37379780" target="_blank">https://zhuanlan.zhihu.com/p/37379780</a></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../2_https和http/" class="navigation navigation-prev " aria-label="Previous page: https和http">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../4_物理层/" class="navigation navigation-next " aria-label="Next page: 物理层">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"TCP中的拥塞控制和流量控制","level":"1.4","depth":1,"next":{"title":"物理层","level":"1.5","depth":1,"path":"4_物理层/README.md","ref":"4_物理层/README.md","articles":[]},"previous":{"title":"https和http","level":"1.3","depth":1,"path":"2_https和http/README.md","ref":"2_https和http/README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"3_TCP中的拥塞控制和流量控制/README.md","mtime":"2021-03-17T00:39:23.706Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-03-17T02:15:43.632Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

