
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>数据链路层 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../6_http中的状态码/" />
    
    
    <link rel="prev" href="../4_物理层/" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    README.md
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../1_三次握手和四次挥手/">
            
                <a href="../1_三次握手和四次挥手/">
            
                    
                    三次握手和四次挥手
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../2_https和http/">
            
                <a href="../2_https和http/">
            
                    
                    https和http
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../3_TCP中的拥塞控制和流量控制/">
            
                <a href="../3_TCP中的拥塞控制和流量控制/">
            
                    
                    TCP中的拥塞控制和流量控制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../4_物理层/">
            
                <a href="../4_物理层/">
            
                    
                    物理层
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.6" data-path="./">
            
                <a href="./">
            
                    
                    数据链路层
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="../6_http中的状态码/">
            
                <a href="../6_http中的状态码/">
            
                    
                    http中的状态码
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >数据链路层</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;">&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;</h1>
<h2 id="&#x94FE;&#x8DEF;&#x548C;&#x6570;&#x636E;&#x94FE;&#x8DEF;">&#x94FE;&#x8DEF;&#x548C;&#x6570;&#x636E;&#x94FE;&#x8DEF;</h2>
<h3 id="&#x94FE;&#x8DEF;">&#x94FE;&#x8DEF;</h3>
<p>&#x4E00;&#x6761;&#x70B9;&#x5230;&#x70B9;&#x7684;&#x7269;&#x7406;&#x7EBF;&#x8DEF;&#x6BB5;&#xFF0C;&#x4E2D;&#x95F4;&#x6CA1;&#x6709;&#x5176;&#x5B83;&#x7684;&#x4EA4;&#x6362;&#x8282;&#x70B9;&#xFF0C;&#x4E00;&#x6761;&#x94FE;&#x8DEF;&#x53EA;&#x662F;&#x4E00;&#x6761;&#x901A;&#x8DEF;&#x7684;&#x4E00;&#x4E2A;&#x7EC4;&#x6210;&#x90E8;&#x5206;</p>
<h3 id="&#x6570;&#x636E;&#x94FE;&#x8DEF;">&#x6570;&#x636E;&#x94FE;&#x8DEF;</h3>
<p>&#x9664;&#x7269;&#x7406;&#x94FE;&#x8DEF;&#x5916;&#xFF0C;&#x8FD8;&#x5FC5;&#x987B;&#x6709;&#x901A;&#x4FE1;&#x534F;&#x8BAE;&#x6765;&#x63A7;&#x5236;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x7684;&#x4F20;&#x8F93;&#xFF0C;&#x82E5;&#x628A;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#x534F;&#x8BAE;&#x7684;&#x786C;&#x4EF6;&#x548C;&#x8F6F;&#x4EF6;&#x52A0;&#x5230;&#x94FE;&#x8DEF;&#x4E0A;&#xFF0C;&#x5C31;&#x6784;&#x6210;&#x4E86;&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x3002;&#x73B0;&#x5E38;&#x89C1;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x9002;&#x914D;&#x5668;&#xFF08;&#x7F51;&#x5361;&#xFF09;&#x6765;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#x534F;&#x8BAE;&#x7684;&#x786C;&#x4EF6;&#x548C;&#x8F6F;&#x4EF6;&#x3002;</p>
<p>&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#x76F8;&#x5F53;&#x4E8E;&#x4E00;&#x4E2A;&#x7BA1;&#x9053;&#xFF0C;&#x4F20;&#x8F93;&#x7684;&#x662F;&#x4E00;&#x6761;&#x6761;&#x7684;&#x5E27;&#x4FE1;&#x606F;</p>
<p><img src="images/image-20200627162011689.png" alt="image-20200627162011689"></p>
<h2 id="&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#x7684;&#x4E3B;&#x8981;&#x529F;&#x80FD;">&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#x7684;&#x4E3B;&#x8981;&#x529F;&#x80FD;</h2>
<ul>
<li>&#x5C01;&#x88C5;&#x6210;&#x5E27;</li>
<li>&#x900F;&#x660E;&#x4F20;&#x8F93;</li>
<li>&#x5DEE;&#x9519;&#x63A7;&#x5236;</li>
</ul>
<h2 id="&#x5C01;&#x88C5;&#x6210;&#x5E27;">&#x5C01;&#x88C5;&#x6210;&#x5E27;</h2>
<p>&#x5C01;&#x88C5;&#x6210;&#x5E27;&#x5C31;&#x662F;&#x4E00;&#x6BB5;&#x6570;&#x636E;&#x7684;&#x524D;&#x540E;&#x5206;&#x522B;&#x6DFB;&#x52A0;&#x9996;&#x90E8;&#x548C;&#x5C3E;&#x90E8;&#xFF0C;&#x7136;&#x540E;&#x6784;&#x6210;&#x4E00;&#x4E2A;&#x5E27;&#xFF0C;&#x786E;&#x5B9A;&#x5E27;&#x7684;&#x754C;&#x9650;</p>
<p>&#x9996;&#x90E8;&#x548C;&#x5C3E;&#x90E8;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x8FDB;&#x884C;&#x5E27;&#x5B9A;&#x754C;</p>
<p><img src="images/image-20200627162616750.png" alt="image-20200627162616750"></p>
<p>&#x4E0B;&#x56FE;&#x662F;&#x4F7F;&#x7528;&#x63A7;&#x5236;&#x5B57;&#x7B26;&#x8FDB;&#x884C;&#x5E27;&#x5B9A;&#x754C;&#x7684;&#x65B9;&#x6CD5;&#x4E3E;&#x4F8B;</p>
<p><img src="images/image-20200627162720414.png" alt="image-20200627162720414"></p>
<p>&#x82E5;&#x5E27;&#x6570;&#x636E;&#x90E8;&#x5206;&#x6709; &#x5F00;&#x59CB;&#x6807;&#x8BB0; &#x548C; &#x7ED3;&#x675F;&#x6807;&#x8BB0;&#x600E;&#x4E48;&#x529E;&#xFF1F;</p>
<p>&#x53D1;&#x9001;&#x7AEF;&#x7684;&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#x5728;&#x6570;&#x636E;&#x4E2D;&#x51FA;&#x73B0;&#x63A7;&#x5236;&#x5B57;&#x7B26; &#x201C;SOH&#x201D; &#x6216; &#x201C;EOT&#x201D;&#x7684;&#x524D;&#x9762;&#x63D2;&#x5165;&#x4E00;&#x4E2A;&#x8F6C;&#x79FB;&#x5B57;&#x7B26; &#x201C;ESC&#x201D;</p>
<p>&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5C31;&#x9700;&#x8981;&#x7528;&#x5230;&#x5B57;&#x8282;&#x586B;&#x5145; &#x6216; &#x5B57;&#x7B26;&#x586B;&#x5145;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x63A5;&#x6536;&#x7AEF;&#x7684;&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#x5728;&#x6570;&#x636E;&#x9001;&#x5F80;&#x7F51;&#x7EDC;&#x5C42;&#x4E4B;&#x95F4;&#x5220;&#x9664;&#x63D2;&#x5165;&#x7684;&#x8F6C;&#x4E49;&#x5B57;&#x7B26;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8F6C;&#x79FB;&#x5B57;&#x7B26;&#x4E5F;&#x51FA;&#x73B0;&#x5728;&#x6570;&#x636E;&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x5E94;&#x8BE5;&#x5728;&#x8F6C;&#x4E49;&#x5B57;&#x7B26;&#x7684;&#x524D;&#x9762;&#x5728;&#x63D2;&#x5165;&#x4E00;&#x4E2A;&#x8F6C;&#x4E49;&#x5B57;&#x7B26;&#x3002;&#x5F53;&#x63A5;&#x6536;&#x7AEF;&#x8FDE;&#x7EED;&#x6536;&#x5230;&#x4E24;&#x4E2A;&#x8F6C;&#x4E49;&#x5B57;&#x7B26;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x5220;&#x9664;&#x6389;&#x524D;&#x9762;&#x7684;&#x4E00;&#x4E2A;</p>
<p><img src="images/image-20200627163044943.png" alt="image-20200627163044943"></p>
<h2 id="&#x5DEE;&#x9519;&#x63A7;&#x5236;">&#x5DEE;&#x9519;&#x63A7;&#x5236;</h2>
<p>&#x4F20;&#x8F93;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x53EF;&#x80FD;&#x4F1A;&#x4EA7;&#x751F;&#x6BD4;&#x7279;&#x5DEE;&#x9519;,1&#x53EF;&#x80FD;&#x53D8;&#x6210;0&#xFF0C;&#x800C;0&#x4E5F;&#x53EF;&#x80FD;&#x53D8;&#x6210;1&#x3002;</p>
<p>&#x5728;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#xFF0C;&#x4F20;&#x8F93;&#x9519;&#x8BEF;&#x7684;&#x6BD4;&#x7279;&#x5360;&#x6240;&#x4F20;&#x8F93;&#x6BD4;&#x7279;&#x603B;&#x6570;&#x7684;&#x6BD4;&#x7387;&#x79F0;&#x4E3A; &#x8BEF;&#x7801;&#x7387; BER&#xFF08;Bit error Rate&#xFF09;&#xFF0C;&#x5176;&#x4E2D;&#x8BEF;&#x7801;&#x7387;&#x548C;&#x4FE1;&#x566A;&#x6BD4;&#x6709;&#x5F88;&#x5927;&#x7684;&#x5173;&#x7CFB;&#x3002;</p>
<h3 id="cpc&#x5FAA;&#x73AF;&#x5197;&#x4F59;&#x68C0;&#x9A8C;">CPC&#x5FAA;&#x73AF;&#x5197;&#x4F59;&#x68C0;&#x9A8C;</h3>
<p>CRC&#x662F;&#x4E00;&#x79CD;&#x5E38;&#x7528;&#x7684;&#x68C0;&#x9519;&#x65B9;&#x6CD5;&#xFF0C;&#x800C;FCS&#x662F;&#x6DFB;&#x52A0;&#x5728;&#x6570;&#x636E;&#x540E;&#x9762;&#x7684;&#x5197;&#x4F59;&#x7801;</p>
<p>FCS&#x53EF;&#x4EE5;&#x7528;CRC&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5F97;&#x51FA;&#xFF0C;&#x5E76;&#x4E14;CRC&#x662F;&#x7528;&#x6765;&#x83B7;&#x53D6;FCS&#x7684;&#x552F;&#x4E00;&#x65B9;&#x6CD5;</p>
<p><img src="images/image-20200627164926128.png" alt="image-20200627164926128"></p>
<p>&#x6211;&#x4EEC;&#x5F97;&#x5230; FCS&#x540E;&#xFF0C;&#x5C06;&#x5176;&#x62FC;&#x63A5;&#x5230;&#x6211;&#x4EEC;&#x4F20;&#x9001;&#x6570;&#x636E;&#x7684;&#x672B;&#x7AEF;</p>
<p><img src="images/image-20200627164944182.png" alt="image-20200627164944182"></p>
<p>&#x63A5;&#x6536;&#x7AEF;&#x5BF9;&#x6536;&#x5230;&#x7684;&#x6BCF;&#x4E00;&#x5E27;&#x8FDB;&#x884C;CRC&#x68C0;&#x9A8C;</p>
<ul>
<li>&#x82E5;&#x5F97;&#x51FA;&#x7684;&#x4F59;&#x6570;  R = 0&#xFF0C;&#x5219;&#x5224;&#x5B9A;&#x8FD9;&#x4E2A;&#x5E27;&#x6CA1;&#x6709;&#x5DEE;&#x9519;&#xFF0C;&#x5C31;&#x63A5;&#x53D7;</li>
<li>&#x82E5;&#x4F59;&#x6570;&#x4E0D;&#x4E3A;0&#xFF0C;&#x5219;&#x5224;&#x5B9A;&#x6709;&#x5DEE;&#x9519;&#xFF0C;&#x4E22;&#x5F03;</li>
</ul>
<p>&#x7279;&#x70B9;</p>
<ul>
<li>&#x8FD9;&#x79CD;&#x5DEE;&#x9519;&#x68C0;&#x6D4B;&#x7684;&#x65B9;&#x6CD5;&#x4E0D;&#x80FD;&#x786E;&#x5B9A;&#x662F;&#x54EA;&#x4E00;&#x4F4D;&#x51FA;&#x73B0;&#x4E86;&#x95EE;&#x9898;</li>
<li>&#x53EA;&#x9700;&#x4F7F;&#x7528;&#x8DB3;&#x591F;&#x7684;&#x4F59;&#x6570;&#xFF0C;&#x5C31;&#x80FD;&#x68C0;&#x6D4B;&#x51FA;&#x6765;</li>
</ul>
<h2 id="&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x7684;&#x6570;&#x636E;&#x94FE;&#x8DEF;">&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x7684;&#x6570;&#x636E;&#x94FE;&#x8DEF;</h2>
<ul>
<li>&#x70B9;&#x5230;&#x70B9;&#xFF1A;PPP&#x534F;&#x8BAE;&#xFF08;&#x5168;&#x4E16;&#x754C;&#x4F7F;&#x7528;&#x6700;&#x591A;&#x7684;&#xFF09;&#xFF0C;&#x53EA;&#x5B9E;&#x73B0;&#x65E0;&#x5DEE;&#x9519;&#x63A5;&#x6536;</li>
<li>&#x96F6;&#x6BD4;&#x7279;&#x586B;&#x5145;&#xFF1A;5&#x4E2A;&#x8FDE;&#x7EED;&#x7684;1&#xFF0C;&#x540E;&#x9762;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;0</li>
</ul>
<h2 id="&#x5C40;&#x57DF;&#x7F51;&#x7684;&#x62D3;&#x6251;&#x7ED3;&#x6784;">&#x5C40;&#x57DF;&#x7F51;&#x7684;&#x62D3;&#x6251;&#x7ED3;&#x6784;</h2>
<p><img src="images/image-20200627181830249.png" alt="image-20200627181830249"></p>
<h2 id="csmacd">CSMA/CD</h2>
<ul>
<li>&#x591A;&#x70B9;&#x63A5;&#x5165;&#xFF1A;&#x8868;&#x793A;&#x8BB8;&#x591A;&#x8BA1;&#x7B97;&#x673A;&#x4EE5;&#x591A;&#x70B9;&#x63A5;&#x5165;&#x7684;&#x65B9;&#x5F0F;&#x8FDE;&#x63A5;&#x5728;&#x4E00;&#x6839;&#x603B;&#x7EBF;&#x4E0A;</li>
<li>&#x8F7D;&#x6CE2;&#x76D1;&#x542C;&#xFF1A;&#x662F;&#x6307;&#x6BCF;&#x4E00;&#x7AD9;&#x5728;&#x53D1;&#x9001;&#x6570;&#x636E;&#x4E4B;&#x524D;&#xFF0C;&#x5148;&#x68C0;&#x6D4B;&#x4E00;&#x4E0B;&#x603B;&#x7EBF;&#x4E0A;&#x662F;&#x5426;&#x6709;&#x5176;&#x5B83;&#x6570;&#x636E;</li>
</ul>
<h2 id="&#x78B0;&#x649E;&#x68C0;&#x6D4B;">&#x78B0;&#x649E;&#x68C0;&#x6D4B;</h2>
<p>&#x78B0;&#x649E;&#x68C0;&#x6D4B;&#x5C31;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x53D1;&#x9001;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x68C0;&#x6D4B;&#x94FE;&#x8DEF;&#x4E0A;&#x4FE1;&#x53F7;&#x7535;&#x538B;&#x7684;&#x5927;&#x5C0F;</p>
<p>&#x4F7F;&#x7528;CSMA/CD&#x534F;&#x8BAE;&#x7684;&#x4EE5;&#x592A;&#x7F51;&#x4E0D;&#x80FD;&#x8FDB;&#x884C;&#x5168;&#x53CC;&#x5DE5;&#x901A;&#x4FE1;&#xFF0C;&#x800C;&#x53EA;&#x80FD;&#x8FDB;&#x884C;&#x53CC;&#x5411;&#x4EA4;&#x66FF;&#x901A;&#x4FE1;&#xFF08;&#x534A;&#x53CC;&#x5DE5;&#x901A;&#x4FE1;&#xFF09;&#xFF0C;&#x6BCF;&#x4E2A;&#x7AD9;&#x53D1;&#x9001;&#x6570;&#x636E;&#x4E4B;&#x540E;&#x4E00;&#x5C0F;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x906D;&#x9047;&#x78B0;&#x649E;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;</p>
<p>&#x53D1;&#x751F;&#x78B0;&#x649E;&#x7684;&#x7AD9;&#x505C;&#x6B62;&#x53D1;&#x9001;&#x6570;&#x636E;&#x540E;&#xFF0C;&#x9700;&#x8981;&#x5EF6;&#x8FDF;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x65F6;&#x95F4; &#x624D;&#x80FD;&#x518D;&#x53D1;&#x9001;&#x6570;&#x636E;&#xFF0C;&#x786E;&#x5B9A;&#x57FA;&#x672C;&#x9000;&#x907F;&#x65F6;&#x95F4;&#xFF0C;&#x4E00;&#x822C;&#x662F;&#x53D6;2T&#xFF0C;&#x5F53;&#x91CD;&#x4F20;16&#x6B21;&#x540E;&#xFF0C;&#x4ECD;&#x7136;&#x4E0D;&#x6210;&#x529F;&#xFF0C;&#x5373;&#x4E22;&#x5F03;&#x8BE5;&#x5E27;&#xFF0C;&#x5E76;&#x5411;&#x9AD8;&#x5C42;&#x62A5;&#x544A;&#x3002;</p>
<h2 id="&#x4EE5;&#x592A;&#x7F51;">&#x4EE5;&#x592A;&#x7F51;</h2>
<p>&#x53EA;&#x8981;&#x6EE1;&#x8DB3;&#x8F7D;&#x6CE2;&#x76D1;&#x542C;&#xFF0C;&#x591A;&#x8DEF;&#x8BBF;&#x95EE;&#x7684;&#x90FD;&#x662F;&#x4EE5;&#x592A;&#x7F51;&#x3002;</p>
<p>&#x540C;&#x65F6;&#x5C40;&#x57DF;&#x7F51;&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;&#x62C6;&#x5206;&#x6210;&#x4E86;&#x4E24;&#x4E2A;&#x5B50;&#x5C42;</p>
<ul>
<li>&#x903B;&#x8F91;&#x94FE;&#x8DEF;&#x63A7;&#x5236;LLC&#x5B50;&#x5C42;</li>
<li>&#x5A92;&#x4F53;&#x63A5;&#x5165;&#x63A7;&#x5236;MAC&#x5B50;&#x5C42;&#xFF0C;&#x73B0;&#x5728;&#x7684;&#x7F51;&#x5361;&#x53EA;&#x6709;MAC&#x5B50;&#x5C42;</li>
</ul>
<p>&#x4EE5;&#x592A;&#x7F51;&#x63D0;&#x4F9B;&#x7684;&#x670D;&#x52A1;&#x662F;&#x4E0D;&#x53EF;&#x9760;&#x7684;&#x4EA4;&#x4ED8;&#xFF0C;&#x5373;&#x5C3D;&#x6700;&#x5927;&#x52AA;&#x529B;&#x7684;&#x4EA4;&#x4ED8;&#x3002;</p>
<h2 id="&#x4FE1;&#x9053;&#x5229;&#x7528;&#x7387;">&#x4FE1;&#x9053;&#x5229;&#x7528;&#x7387;</h2>
<p>$$
\partial=\frac{\tau}{T_{0}}</p>
<p>$$</p>
<h2 id="&#x6D41;&#x91CF;&#x63A7;&#x5236;&#x534F;&#x8BAE;">&#x6D41;&#x91CF;&#x63A7;&#x5236;&#x534F;&#x8BAE;</h2>
<h3 id="&#x5355;&#x5DE5;&#x505C;&#x7B49;&#x534F;&#x8BAE;">&#x5355;&#x5DE5;&#x505C;&#x7B49;&#x534F;&#x8BAE;</h3>
<p>stop and wait&#xFF0C;&#x94FE;&#x8DEF;&#x4E0D;&#x51FA;&#x9519;&#xFF0C;&#x4F46;&#x6709;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x6D41;&#x91CF;&#x4E0D;&#x5339;&#x914D;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x53D1;&#x9001;&#x65B9;&#x6BCF;&#x53D1;&#x4E00;&#x5E27;&#x505C;&#x4E0B;&#x6765;&#xFF0C;&#x6BCF;&#x6536;&#x5230;&#x4E00;&#x5E27;&#x540E;&#xFF0C;&#x4E0A;&#x4EA4;&#x7F51;&#x7EDC;&#x5C42;&#xFF0C;&#x518D;&#x53D1;&#x4E00;&#x4E2A;&#x786E;&#x8BA4;&#x7ED9;&#x53D1;&#x9001;&#x65B9;&#xFF0C;&#x8868;&#x793A;&#x6536;&#x5230;&#x3002;&#x53D1;&#x9001;&#x65B9;&#x6536;&#x5230;&#x786E;&#x8BA4;&#x5728;&#x53D1;&#x9001;&#x4E0B;&#x4E00;&#x4E2A;&#x3002;</p>
<h3 id="&#x8FDE;&#x7EED;arq">&#x8FDE;&#x7EED;ARQ</h3>
<p>&#x81EA;&#x52A8;&#x8BF7;&#x6C42;&#x91CD;&#x53D1;&#x534F;&#x8BAE;&#x3002;</p>
<ul>
<li>&#x53D1;&#x9001;&#x7AEF;&#xFF1A;&#x5728;&#x53D1;&#x9001;&#x5B8C;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E27;&#x540E;&#xFF0C;&#x4E0D;&#x662F;&#x505C;&#x4E0B;&#x6765;&#x7B49;&#x5F85;&#x5E94;&#x7B54;&#x5E27;&#xFF0C;&#x800C;&#x662F;&#x53EF;&#x4EE5;&#x8FDE;&#x63A5;&#x518D;&#x53D1;&#x9001;&#x4E0B;&#x9762;&#x7684;&#x6570;&#x636E;&#x5E27;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x65F6;&#x6536;&#x5230;&#x4E86;&#x63A5;&#x6536;&#x7AEF;&#x53D1;&#x6765;&#x7684;&#x786E;&#x8BA4;&#x5E27;&#xFF0C;&#x90A3;&#x4E48;&#x8FD8;&#x53EF;&#x4EE5;&#x63A5;&#x7740;&#x518D;&#x53D1;&#x9001;&#x4E0B;&#x9762;&#x7684;&#x6570;&#x636E;&#x5E27;&#x3002;&#x5982;&#x679C;&#x8D85;&#x65F6;&#x65F6;&#x95F4;&#x5230;&#xFF0C;&#x4ECD;&#x7136;&#x6CA1;&#x6709;&#x6536;&#x5230;&#x76F8;&#x5E94;&#x7684;&#x786E;&#x8BA4;&#x5E27;&#xFF0C;&#x5219;&#x91CD;&#x65B0;&#x4ECE;&#x8FD9;&#x4E2A;&#x5E27;&#x5F00;&#x59CB;&#x91CD;&#x4F20;&#x3002;&#xFF08;go back  N ARQ&#xFF09;</li>
<li>&#x63A5;&#x6536;&#x7AEF;&#xFF1A;&#x8FDE;&#x7EED;&#x63A5;&#x6536;&#x5E27;&#xFF0C;&#x5F53;&#x63A5;&#x6536;&#x5230;&#x4E00;&#x4E2A;&#x574F;&#x5E27;&#x65F6;&#xFF0C;&#x7B80;&#x5355;&#x4E22;&#x5F03;&#x8FD9;&#x4E2A;&#x5E27;&#x548C;&#x8FD9;&#x4E2A;&#x5E27;&#x4EE5;&#x540E;&#x7684;&#x6240;&#x6709;&#x5E27;&#xFF0C;&#x8BA9;&#x4ED6;&#x4EEC;&#x5728;&#x53D1;&#x9001;&#x7AEF;&#x8D85;&#x65F6;&#xFF0C;&#x8FD9;&#x9053;&#x6536;&#x5230;&#x8FD9;&#x4E2A;&#x5E27;&#x4E3A;&#x6B62;&#x3002;</li>
</ul>
<h3 id="&#x505C;&#x6B62;&#x7B49;&#x5F85;&#x534F;&#x8BAE;&#x548C;&#x8FDE;&#x7EED;arq&#x534F;&#x8BAE;&#x7684;&#x95EE;&#x9898;">&#x505C;&#x6B62;&#x7B49;&#x5F85;&#x534F;&#x8BAE;&#x548C;&#x8FDE;&#x7EED;ARQ&#x534F;&#x8BAE;&#x7684;&#x95EE;&#x9898;</h3>
<h4 id="&#x505C;&#x6B62;&#x7B49;&#x5F85;&#x534F;&#x8BAE;">&#x505C;&#x6B62;&#x7B49;&#x5F85;&#x534F;&#x8BAE;</h4>
<p>&#x53D1;&#x9001; - &#x505C;&#x6B62; - &#x7B49;&#x5F85;&#xFF0C;&#x6548;&#x7387;&#x8F83;&#x4F4E;&#xFF0C;&#x5F53;&#x4F20;&#x64AD;&#x65F6;&#x95F4;&#x6BD4;&#x53D1;&#x9001;&#x65F6;&#x95F4;&#x5927;&#x5F97;&#x591A;&#x65F6;&#xFF0C;&#x6027;&#x80FD;&#x53D8;&#x5F97;&#x4E0D;&#x53EF;&#x63A5;&#x53D7;</p>
<h4 id="&#x8FDE;&#x7EED;arq&#x534F;&#x8BAE;">&#x8FDE;&#x7EED;ARQ&#x534F;&#x8BAE;</h4>
<ul>
<li>&#x672A;&#x7ECF;&#x786E;&#x5B9A;&#x7684;&#x5E27;&#x4E00;&#x6B21;&#x4F20;&#x9001;&#x8FC7;&#x591A;&#xFF0C;&#x5982;&#x679C;&#x51FA;&#x9519;&#xFF0C;&#x91CD;&#x4F20;&#x7684;&#x4EE3;&#x4EF7;&#x592A;&#x5927;</li>
<li>&#x5E8F;&#x53F7;&#x7AD9;&#x7684;&#x4F4D;&#x6570;&#x8FC7;&#x591A;&#xFF0C;&#x5F71;&#x54CD;&#x6548;&#x7387;&#xFF0C;&#x4E00;&#x6B21;&#x80FD;&#x4F20;&#x9001;1024&#x4E2A;&#x5E27;&#xFF0C;10&#x4F4D;&#x7F16;&#x53F7;</li>
<li>&#x5B9E;&#x9645;&#x534F;&#x8BAE;&#x4E2D;&#xFF0C;&#x4E00;&#x6B21;&#x8FDE;&#x7EED;&#x4F20;&#x8F93;&#x7684;&#x5E27;&#x7684;&#x4E2A;&#x6570;&#x662F;&#x6709;&#x9650;&#x7684;</li>
</ul>
<h3 id="&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x534F;&#x8BAE;">&#x6ED1;&#x52A8;&#x7A97;&#x53E3;&#x534F;&#x8BAE;</h3>
<p>&#x5B83;&#x662F;&#x505C;&#x6B62;&#x7B49;&#x5F85;&#x534F;&#x8BAE; &#x548C; &#x8FDE;&#x7EED;ARQ&#x534F;&#x8BAE;&#x7684;&#x6298;&#x4E2D;</p>
<p>&#x4E00;&#x6B21;&#x53D1;&#x9001;&#x4E3A;&#x786E;&#x5B9A;&#x7684;&#x5E27;&#x7684;&#x4E2A;&#x6570;&#x662F;&#x6709;&#x9650;&#x7684;</p>
<ul>
<li>&#x53D1;&#x9001;&#x7AEF;&#xFF1A;&#x4E00;&#x6B21;&#x53D1;&#x9001;&#x672A;&#x7ECF;&#x786E;&#x5B9A;&#x7684;&#x5E27;&#x662F;&#x6536;&#x5230;&#x53D1;&#x9001;&#x7A97;&#x53E3;&#x7684;&#x63A7;&#x5236;&#x7684;&#xFF0C;&#x53EA;&#x6709;&#x843D;&#x5728;&#x53D1;&#x9001;&#x7A97;&#x53E3;&#x7684;&#x5E27;&#x624D;&#x662F;&#x53EF;&#x4EE5;&#x53D1;&#x9001;&#x7684;</li>
<li>&#x63A5;&#x6536;&#x7AEF;&#xFF1A;&#x53EA;&#x6709;&#x843D;&#x5728;&#x63A5;&#x6536;&#x7A97;&#x53E3;&#x7684;&#x5E27;&#x624D;&#x662F;&#x53EF;&#x4EE5;&#x63A5;&#x6536;&#x7684;&#x3002;</li>
</ul>
<p>&#x51FA;&#x73B0;&#x5DEE;&#x9519;&#x7684;&#x5904;&#x7406;&#x529E;&#x6CD5;</p>
<p>&#x4E00;&#x6BB5;&#x6536;&#x5230;&#x51FA;&#x9519;&#x7684;&#x5E27;&#x540E;&#x8FDB;&#x884C;&#x4E22;&#x5F03;&#xFF0C;&#x4E0D;&#x53D1;&#x9001;&#x786E;&#x5B9A;&#x62A5;&#x6587;&#xFF0C;&#x8BA9;&#x53D1;&#x9001;&#x65B9;&#x8D85;&#x65F6;&#x91CD;&#x53D1;&#x3002;&#x5BF9;&#x540E;&#x9762;&#x9646;&#x7EED;&#x5230;&#x8FBE;&#x7684;&#x6B63;&#x786E;&#x7684;&#x5E27;&#x8FDB;&#x884C;&#x540C;&#x6837;&#x7684;&#x5904;&#x7406;&#x529E;&#x6CD5; </p>
<ul>
<li>&#x5F53;w<sub>r</sub> = 1&#x65F6;<ul>
<li>&#x63A5;&#x6536;&#x65B9;&#xFF1A;&#x5168;&#x90E8;&#x4E22;&#x5F03;&#xFF08;drop&#xFF09;&#xFF0C;&#x94FE;&#x8DEF;&#x5C42;&#x53EA;&#x6309;&#x987A;&#x5E8F;&#x63A5;&#x6536;&#x5E27;</li>
<li>&#x53D1;&#x9001;&#x65B9;&#xFF1A;2&#x53F7;&#x5E27;&#x8D85;&#x65F6;&#x540E;&#xFF0C;&#x4ECE;2&#x53F7;&#x5E27;&#x5F00;&#x59CB;&#x53D1;&#x9001;</li>
<li>&#x56DE;&#x9000;n&#x5E27;&#xFF0C;&#xFF08;go back N protocol&#xFF09;</li>
</ul>
</li>
<li>&#x5F53; w<sub>r</sub> &gt; 1&#x65F6;<ul>
<li>&#x63A5;&#x6536;&#x65B9;&#xFF1A;&#x9646;&#x7EED;&#x63A5;&#x6536;&#x51FA;&#x9519;&#x7684;&#x540E;&#x7EED;&#x5404;&#x4E2A;&#x5E27;&#xFF0C;&#x4F46;&#x4E0D;&#x63D0;&#x4EA4;&#x7ED9;&#x7F51;&#x7EDC;&#x5C42;&#xFF0C;&#x77E5;&#x9053;&#x63A5;&#x6536;&#x5230;2&#x53F7;&#x5E27;&#x4EE5;&#x540E;&#xFF0C;&#x52A0;&#x4E0A;&#x4EE5;&#x540E;&#x5B58;&#x50A8;&#x7684;&#x5404;&#x5E27;&#xFF0C;&#x6309;&#x987A;&#x5E8F;&#x4EA4;&#x7ED9;&#x7F51;&#x7EDC;&#x5C42;</li>
<li>&#x53D1;&#x9001;&#x65B9;&#xFF1A;2&#x53F7;&#x5E27;&#x8D85;&#x65F6;&#x540E;&#xFF0C;&#x53D1;&#x5B8C;2&#x53F7;&#x5E27;&#x4E4B;&#x540E;&#xFF0C;&#x4ECE;&#x7B2C;6&#x53F7;&#x5E27;&#x5F00;&#x59CB;&#xFF0C;&#x9009;&#x62E9;&#x6027;&#x91CD;&#x4F20;</li>
</ul>
</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../4_物理层/" class="navigation navigation-prev " aria-label="Previous page: 物理层">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../6_http中的状态码/" class="navigation navigation-next " aria-label="Next page: http中的状态码">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"数据链路层","level":"1.6","depth":1,"next":{"title":"http中的状态码","level":"1.7","depth":1,"path":"6_http中的状态码/README.md","ref":"6_http中的状态码/README.md","articles":[]},"previous":{"title":"物理层","level":"1.5","depth":1,"path":"4_物理层/README.md","ref":"4_物理层/README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"5_数据链路层/README.md","mtime":"2021-03-17T00:39:23.720Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-03-17T02:15:43.632Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

