
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>https和http · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../3_TCP中的拥塞控制和流量控制/" />
    
    
    <link rel="prev" href="../1_三次握手和四次挥手/" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    README.md
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../1_三次握手和四次挥手/">
            
                <a href="../1_三次握手和四次挥手/">
            
                    
                    三次握手和四次挥手
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="./">
            
                <a href="./">
            
                    
                    https和http
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../3_TCP中的拥塞控制和流量控制/">
            
                <a href="../3_TCP中的拥塞控制和流量控制/">
            
                    
                    TCP中的拥塞控制和流量控制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../4_物理层/">
            
                <a href="../4_物理层/">
            
                    
                    物理层
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../5_数据链路层/">
            
                <a href="../5_数据链路层/">
            
                    
                    数据链路层
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="../6_http中的状态码/">
            
                <a href="../6_http中的状态码/">
            
                    
                    http中的状态码
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >https和http</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="http&#x548C;https">http&#x548C;https</h1>
<h2 id="http">http</h2>
<p>http&#x662F;&#x4E00;&#x79CD;&#x65E0;&#x72B6;&#x6001;&#x534F;&#x8BAE;&#x3002;&#x65E0;&#x72B6;&#x6001;&#x662F;&#x6307;&#x5BA2;&#x6237;&#x673A;&#x548C;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x4E0D;&#x9700;&#x8981;&#x5EFA;&#x7ACB;&#x6301;&#x4E45;&#x8FDE;&#x63A5;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5F53;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x5411;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x51FA;&#x8BF7;&#x6C42;&#xFF0C;&#x7136;&#x540E;&#x670D;&#x52A1;&#x5668;&#x8FD4;&#x56DE;&#x54CD;&#x5E94;&#xFF08;response&#xFF09;&#xFF0C;&#x8FDE;&#x63A5;&#x5C31;&#x88AB;&#x5173;&#x95ED;&#x4E86;&#xFF0C;&#x5728;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x4E0D;&#x4FDD;&#x7559;&#x8FDE;&#x63A5;&#x7684;&#x6709;&#x5173;&#x4FE1;&#x606F;&#xFF0C;HTTP&#x9075;&#x5FAA;&#x8BF7;&#x6C42;/&#x5E94;&#x7B54;&#x6A21;&#x578B;&#x3002;&#x5BA2;&#x6237;&#x673A;&#x5411;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#x5E76;&#x8FD4;&#x56DE;&#x9002;&#x5F53;&#x7684;&#x5E94;&#x7B54;&#x3002;&#x6240;&#x6709;HTTP&#x8FDE;&#x63A5;&#x90FD;&#x6784;&#x6210;&#x4E00;&#x5957;&#x8BF7;&#x6C42;&#x548C;&#x5E94;&#x7B54;&#x3002;</p>
<h2 id="https">https</h2>
<p>HTTPS&#x662F;&#x4EE5;&#x5B89;&#x5168;&#x4E3A;&#x76EE;&#x6807;&#x7684;HTTP&#x901A;&#x9053;&#xFF0C;&#x7B80;&#x5355;&#x5C06;&#x5C31;&#x662F;HTTP&#x7684;&#x5B89;&#x5168;&#x7248;&#x3002;&#x5373;HTTP&#x4E0B;&#x52A0;&#x5165;SSL&#x5C42;&#xFF0C;HTTPS&#x7684;&#x5B89;&#x5168;&#x57FA;&#x7840;&#x662F;SSL&#x3002;&#x5176;&#x6240;&#x7528;&#x7684;&#x7AEF;&#x53E3;&#x662F;443&#xFF0C;&#x8FC7;&#x7A0B;&#x5927;&#x81F4;&#x5982;&#x4E0B;&#xFF1A;</p>
<h3 id="&#x83B7;&#x53D6;&#x8FDE;&#x63A5;&#x8BC1;&#x4E66;">&#x83B7;&#x53D6;&#x8FDE;&#x63A5;&#x8BC1;&#x4E66;</h3>
<p>SSL&#x5BA2;&#x6237;&#x7AEF;&#x901A;&#x8FC7;TCP&#x548C;&#x670D;&#x52A1;&#x5668;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x540E;&#xFF08;443&#x7AEF;&#x53E3;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x4E00;&#x822C;&#x7684;TCP&#x8FDE;&#x63A5;&#x534F;&#x5546;&#x8FC7;&#x7A0B;&#x4E2D;&#x8BF7;&#x6C42;&#x8BC1;&#x4E66;&#x3002;&#x5373;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x51FA;&#x4E00;&#x4E2A;&#x6D88;&#x606F;&#x7ED9;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x8FD9;&#x4E2A;&#x6D88;&#x606F;&#x91CC;&#x9762;&#x5305;&#x542B;&#x4E86;&#x81EA;&#x5DF1;&#x53EF;&#x5B9E;&#x73B0;&#x7684;&#x7B97;&#x6CD5;&#x5217;&#x8868;&#x548C;&#x5176;&#x5B83;&#x4E00;&#x4E9B;&#x9700;&#x8981;&#x7684;&#x6D88;&#x606F;&#xFF0C;SSL&#x7684;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x4F1A;&#x56DE;&#x5E94;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x8FD9;&#x91CC;&#x9762;&#x786E;&#x5B9A;&#x4E86;&#x8FD9;&#x6B21;&#x901A;&#x4FE1;&#x6240;&#x9700;&#x8981;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x7136;&#x540E;&#x670D;&#x52A1;&#x5668;&#x5411;&#x5BA2;&#x6237;&#x7AEF;&#x8FD4;&#x56DE;&#x8BC1;&#x4E66;&#x3002;&#xFF08;&#x8BC1;&#x4E66;&#x91CC;&#x9762;&#x5305;&#x542B;&#x4E86;&#x670D;&#x52A1;&#x5668;&#x4FE1;&#x606F;&#xFF1A;&#x57DF;&#x540D;&#x3002;&#x7533;&#x8BF7;&#x8BC1;&#x4E66;&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x516C;&#x5171;&#x5BC6;&#x94A5;&#xFF09;</p>
<h3 id="&#x8BC1;&#x4E66;&#x9A8C;&#x8BC1;">&#x8BC1;&#x4E66;&#x9A8C;&#x8BC1;</h3>
<p>&#x5BA2;&#x6237;&#x7AEF;&#x5728;&#x6536;&#x5230;&#x670D;&#x52A1;&#x5668;&#x8FD4;&#x56DE;&#x7684;&#x8BC1;&#x4E66;&#x540E;&#xFF0C;&#x5224;&#x65AD;&#x7B7E;&#x53D1;&#x8FD9;&#x4E2A;&#x8BC1;&#x4E66;&#x7684;&#x516C;&#x5171;&#x7B7E;&#x53D1;&#x673A;&#x6784;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x673A;&#x6784;&#x7684;&#x516C;&#x5171;&#x5BC6;&#x94A5;&#x786E;&#x8BA4;&#x7B7E;&#x540D;&#x662F;&#x5426;&#x6709;&#x6548;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x8FD8;&#x4F1A;&#x786E;&#x4FDD;&#x8BC1;&#x4E66;&#x4E2D;&#x5217;&#x51FA;&#x7684;&#x57DF;&#x540D;&#x5C31;&#x662F;&#x5B83;&#x6B63;&#x5728;&#x8FDE;&#x63A5;&#x7684;&#x57DF;&#x540D;</p>
<h3 id="&#x6570;&#x636E;&#x52A0;&#x5BC6;&#x548C;&#x4F20;&#x8F93;">&#x6570;&#x636E;&#x52A0;&#x5BC6;&#x548C;&#x4F20;&#x8F93;</h3>
<p>&#x5982;&#x679C;&#x786E;&#x8BA4;&#x8BC1;&#x4E66;&#x6709;&#x6548;&#xFF0C;&#x90A3;&#x4E48;&#x751F;&#x6210;&#x5BF9;&#x79F0;&#x5BC6;&#x94A5;&#x5E76;&#x4F7F;&#x7528;&#x670D;&#x52A1;&#x5668;&#x7684;&#x516C;&#x5171;&#x5BC6;&#x94A5;&#x8FDB;&#x884C;&#x52A0;&#x5BC6;&#x3002;&#x7136;&#x540E;&#x53D1;&#x9001;&#x7ED9;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x4F7F;&#x7528;&#x5B83;&#x7684;&#x5BC6;&#x94A5;&#x8FDB;&#x884C;&#x89E3;&#x5BC6;&#xFF0C;&#x8FD9;&#x6837;&#x4E24;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x8FDB;&#x884C;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x3002;</p>
<p><img src="images/image-20200413085448943.png" alt="image-20200413085448943"></p>
<p>&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#xFF1A;&#x662F;&#x6307;&#x52A0;&#x5BC6;&#x548C;&#x89E3;&#x5BC6;&#x7528;&#x7684;&#x90FD;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x5BC6;&#x94A5;&#xFF0C;&#x76EE;&#x524D;&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#x91C7;&#x7528;&#x7684;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x52A0;&#x5BC6;&#x65B9;&#x5F0F;</p>
<h3 id="&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x5B58;&#x5728;&#x7684;&#x95EE;&#x9898;">&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x5B58;&#x5728;&#x7684;&#x95EE;&#x9898;</h3>
<p>&#x9996;&#x5148;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x662F;&#x6307;&#xFF1A;&#x52A0;&#x5BC6;&#x548C;&#x89E3;&#x5BC6;&#x90FD;&#x4F7F;&#x7528;&#x7684;&#x540C;&#x4E00;&#x4E2A;&#x5BC6;&#x94A5;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5B58;&#x5728;&#x7684;&#x6700;&#x5927;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x5BC6;&#x94A5;&#x53D1;&#x9001;&#x95EE;&#x9898;&#xFF0C;&#x5373;&#x5982;&#x679C;&#x5B89;&#x5168;&#x7684;&#x5C06;&#x5BC6;&#x94A5;&#x53D1;&#x9001;&#x7ED9;&#x5BF9;&#x65B9;&#x3002;</p>
<h4 id="&#x4E3A;&#x4EC0;&#x4E48;&#x53EB;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#xFF1F;">&#x4E3A;&#x4EC0;&#x4E48;&#x53EB;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#xFF1F;</h4>
<p>&#x4E00;&#x65B9;&#x901A;&#x8FC7;&#x5BC6;&#x94A5;&#x5C06;&#x4FE1;&#x606F;&#x52A0;&#x5BC6;&#x540E;&#xFF0C;&#x628A;&#x5BC6;&#x6587;&#x4F20;&#x7ED9;&#x53E6;&#x4E00;&#x4E2A;&#x65B9;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x76F8;&#x540C;&#x7684;&#x5BC6;&#x94A5;&#x5C06;&#x5BC6;&#x6587;&#x89E3;&#x5BC6;&#xFF0C;&#x8F6C;&#x6362;&#x6210;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x7684;&#x660E;&#x6587;&#x3002;&#x4ED6;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x5982;&#x4E0B;</p>
<blockquote>
<p>&#x660E;&#x6587; -&gt; &#x5BC6;&#x94A5; -&gt; &#x5BC6;&#x6587;</p>
</blockquote>
<p>&#x4F46;&#x662F;&#x4ECE;&#x4E0A;&#x9762;&#x7684;&#x56FE;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x8FDB;&#x884C;&#x52A0;&#x5BC6;&#x540E;&#xFF0C;&#x9996;&#x5148;&#x9700;&#x8981;&#x5C06;&#x5BC6;&#x94A5;&#x53D1;&#x9001;&#x7ED9;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x5C31;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x5371;&#x9669;&#x7684;</p>
<p><img src="images/image-20200413091318404.png" alt="image-20200413091318404"></p>
<h3 id="&#x975E;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;">&#x975E;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;</h3>
<p>&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x662F;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#xFF0C;&#x5176;&#x5B9E;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x662F;&#x975E;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#xFF0C;&#x975E;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x662F;&#x901A;&#x8FC7;&#x4E24;&#x4E2A;&#x5BC6;&#x94A5;&#xFF08;&#x516C;&#x94A5; - &#x79C1;&#x94A5;&#xFF09;&#x6765;&#x5B9E;&#x73B0;&#x5BF9;&#x6570;&#x636E;&#x7684;&#x52A0;&#x5BC6;&#x548C;&#x89E3;&#x5BC6;&#x7684;&#xFF0C;&#x516C;&#x94A5;&#x7528;&#x4E8E;&#x52A0;&#x5BC6;&#xFF0C;&#x79C1;&#x94A5;&#x7528;&#x4E8E;&#x89E3;&#x5BC6;&#x3002;</p>
<p><img src="images/image-20200413085937800.png" alt="image-20200413085937800"></p>
<p>&#x8FC7;&#x7A0B;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>&#x9996;&#x5148;&#x670D;&#x52A1;&#x5668;&#x4F1A;&#x9881;&#x53D1;&#x4E00;&#x4E2A;&#x516C;&#x94A5;&#x653E;&#x5728;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x540C;&#x65F6;&#x5B83;&#x81EA;&#x5DF1;&#x8FD8;&#x6709;&#x4E00;&#x4EFD;&#x79C1;&#x94A5;&#xFF0C;&#x7136;&#x540E;&#x5BA2;&#x6237;&#x7AEF;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x83B7;&#x53D6;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x516C;&#x94A5;</p>
<p>&#x7136;&#x540E;&#x5C06;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x516C;&#x94A5;&#x7684;&#x52A0;&#x5BC6;&#xFF0C;&#x52A0;&#x5BC6;&#x540E;&#x4F20;&#x8F93;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E2D;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x5728;&#x8FDB;&#x884C;&#x79C1;&#x94A5;&#x89E3;&#x5BC6;&#xFF0C;&#x5F97;&#x5230;&#x6700;&#x7EC8;&#x7684;&#x6570;&#x636E;</p>
<p><img src="images/image-20200413102124070.png" alt="image-20200413102124070"></p>
<p>&#x7531;&#x4E8E;&#x975E;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x7684;&#x65B9;&#x5F0F;&#x4E0D;&#x9700;&#x8981;&#x53D1;&#x9001;&#x7528;&#x6765;&#x89E3;&#x5BC6;&#x7684;&#x79C1;&#x94A5;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x4F46;&#x662F;&#x548C;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x6BD4;&#x8D77;&#x6765;&#xFF0C;&#x5B83;&#x975E;&#x5E38;&#x6162;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x8FD8;&#x662F;&#x8981;&#x7528;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x6765;&#x4F20;&#x9001;&#x6D88;&#x606F;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x4F7F;&#x7528;&#x7684;&#x5BC6;&#x94A5;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x975E;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x7684;&#x65B9;&#x5F0F;&#x53D1;&#x9001;&#x51FA;&#x53BB;&#x3002;&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#xFF1A;</p>
<p><img src="images/image-20200413102622594.png" alt="image-20200413102622594"></p>
<p>&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x6B64;&#x65F6;&#x4EA4;&#x6362;&#x7684;&#x4E24;&#x4E2A;&#x516C;&#x94A5;&#x4E0D;&#x4E00;&#x5B9A;&#x6B63;&#x786E;&#xFF0C;&#x56E0;&#x4E3A;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x4E2D;&#x95F4;&#x4EBA;&#x622A;&#x83B7;&#xFF0C;&#x540C;&#x65F6;&#x6389;&#x5305;</p>
<p>&#x4F8B;&#x5982;&#xFF1A;&#x4E2D;&#x95F4;&#x4EBA;&#x867D;&#x7136;&#x4E0D;&#x77E5;&#x9053;&#x5C0F;&#x7EA2;&#x7684;&#x79C1;&#x94A5;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x622A;&#x83B7;&#x4E86;&#x5C0F;&#x7EA2;&#x7684;&#x516C;&#x94A5;Key1&#x4E4B;&#x540E;&#xFF0C;&#x5374;&#x53EF;&#x4EE5;&#x5077;&#x5929;&#x6362;&#x65E5;&#xFF0C;&#x81EA;&#x5DF1;&#x53E6;&#x5916;&#x751F;&#x6210;&#x4E00;&#x5BF9;&#x516C;&#x94A5;&#x79C1;&#x94A5;&#xFF0C;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x516C;&#x94A5;Key3&#x53D1;&#x9001;&#x7ED9;&#x5C0F;&#x7070;&#x3002;</p>
<p><img src="images/image-20200413102718466.png" alt="image-20200413102718466"></p>
<p>&#x8FD9;&#x4E00;&#x6B21;&#x901A;&#x4FE1;&#x518D;&#x6B21;&#x88AB;&#x4E2D;&#x95F4;&#x4EBA;&#x622A;&#x83B7;&#xFF0C;&#x4E2D;&#x95F4;&#x4EBA;&#x5148;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x79C1;&#x94A5;&#x89E3;&#x5F00;&#x4E86;Key3&#x7684;&#x52A0;&#x5BC6;&#xFF0C;&#x83B7;&#x5F97;Key2&#xFF0C;&#x7136;&#x540E;&#x518D;&#x7528;&#x5F53;&#x521D;&#x5C0F;&#x7EA2;&#x53D1;&#x6765;&#x7684;Key1&#x91CD;&#x65B0;&#x52A0;&#x5BC6;&#xFF0C;&#x518D;&#x53D1;&#x7ED9;&#x5C0F;&#x7EA2;</p>
<p><img src="images/image-20200413102738635.png" alt="image-20200413102738635"></p>
<h3 id="&#x8BC1;&#x4E66;&#x673A;&#x5236;">&#x8BC1;&#x4E66;&#x673A;&#x5236;</h3>
<p>&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x4ECE;&#x6307;&#x5B9A;&#x7684;&#x673A;&#x6784;&#x51FA;&#x83B7;&#x53D6;&#x516C;&#x94A5;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4EFB;&#x7531;&#x5176;&#x5728;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;</p>
<ul>
<li>&#x4F5C;&#x4E3A;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x7684;&#x5C0F;&#x7EA2;&#xFF0C;&#x9996;&#x5148;&#x5148;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x516C;&#x94A5;&#x7ED9;&#x8BC1;&#x4E66;&#x9881;&#x53D1;&#x673A;&#x6784;&#xFF0C;&#x5411;&#x8BC1;&#x4E66;&#x9881;&#x53D1;&#x673A;&#x6784;&#x7533;&#x8BF7;&#x8BC1;&#x4E66;</li>
<li>&#x8BC1;&#x4E66;&#x9881;&#x53D1;&#x673A;&#x6784;&#x81EA;&#x5DF1;&#x4E5F;&#x6709;&#x4E00;&#x5806;&#x516C;&#x94A5;&#x548C;&#x79C1;&#x94A5;&#x3002;&#x673A;&#x6784;&#x5229;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x79C1;&#x94A5;&#x6765;&#x89E3;&#x5BC6;Key1&#xFF0C;&#x901A;&#x8FC7;&#x670D;&#x52A1;&#x7AEF;&#x7F51;&#x5740;&#x7B49;&#x4FE1;&#x606F;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x8BC1;&#x4E66;&#x7B7E;&#x540D;&#xFF0C;&#x8BC1;&#x4E66;&#x7B7E;&#x540D;&#x540C;&#x6837;&#x7ECF;&#x8FC7;&#x673A;&#x6784;&#x7684;&#x79C1;&#x94A5;&#x52A0;&#x5BC6;&#x3002;&#x8BC1;&#x4E66;&#x5236;&#x4F5C;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x673A;&#x6784;&#x628A;&#x8BC1;&#x4E66;&#x53D1;&#x9001;&#x7ED9;&#x670D;&#x52A1;&#x7AEF;&#x7684;&#x5C0F;&#x7EA2;&#x3002;</li>
<li>&#x5F53;&#x5C0F;&#x7070;&#x5411;&#x5C0F;&#x7EA2;&#x8BF7;&#x6C42;&#x901A;&#x4FE1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C0F;&#x7EA2;&#x4E0D;&#x518D;&#x76F4;&#x63A5;&#x8FD4;&#x56DE;&#x81EA;&#x5DF1;&#x7684;&#x516C;&#x94A5;&#xFF0C;&#x800C;&#x662F;&#x628A;&#x81EA;&#x5DF1;&#x7533;&#x8BF7;&#x7684;&#x8BC1;&#x4E66;&#x8FD4;&#x56DE;&#x7ED9;&#x5C0F;&#x7070;&#x3002;</li>
<li>&#x5C0F;&#x7070;&#x6536;&#x5230;&#x8BC1;&#x4E66;&#x4EE5;&#x540E;&#xFF0C;&#x8981;&#x505A;&#x7684;&#x7B2C;&#x4E00;&#x4EF6;&#x4E8B;&#x5C31;&#x662F;&#x9A8C;&#x8BC1;&#x8BC1;&#x4E66;&#x7684;&#x771F;&#x4F2A;&#xFF0C;&#x9700;&#x8981;&#x8BF4;&#x660E;&#x7684;&#x662F;&#xFF0C;&#x5404;&#x5927;&#x6D4F;&#x89C8;&#x5668;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5DF2;&#x7ECF;&#x7EF4;&#x62A4;&#x4E86;&#x6240;&#x6709;&#x6743;&#x5A01;&#x8BC1;&#x4E66;&#x673A;&#x6784;&#x7684;&#x540D;&#x79F0;&#x548C;&#x516C;&#x94A5;&#xFF0C;&#x6240;&#x4EE5;&#x5C0F;&#x7070;&#x53EA;&#x9700;&#x8981;&#x77E5;&#x9053;&#x662F;&#x54EA;&#x4E2A;&#x673A;&#x6784;&#x9881;&#x53D1;&#x7684;&#x8BC1;&#x4E66;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4ECE;&#x672C;&#x5730;&#x627E;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x673A;&#x6784;&#x516C;&#x94A5;&#xFF0C;&#x89E3;&#x5BC6;&#x51FA;&#x8BC1;&#x4E66;&#x7B7E;&#x540D;&#x3002;</li>
</ul>
<p><img src="images/image-20200413103251089.png" alt="image-20200413103251089"></p>
<h2 id="&#x53C2;&#x8003;">&#x53C2;&#x8003;</h2>
<p><a href="https://blog.csdn.net/jiangshangchunjiezi/article/details/88545263" target="_blank">https://blog.csdn.net/jiangshangchunjiezi/article/details/88545263</a></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../1_三次握手和四次挥手/" class="navigation navigation-prev " aria-label="Previous page: 三次握手和四次挥手">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../3_TCP中的拥塞控制和流量控制/" class="navigation navigation-next " aria-label="Next page: TCP中的拥塞控制和流量控制">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"https和http","level":"1.3","depth":1,"next":{"title":"TCP中的拥塞控制和流量控制","level":"1.4","depth":1,"path":"3_TCP中的拥塞控制和流量控制/README.md","ref":"3_TCP中的拥塞控制和流量控制/README.md","articles":[]},"previous":{"title":"三次握手和四次挥手","level":"1.2","depth":1,"path":"1_三次握手和四次挥手/README.md","ref":"1_三次握手和四次挥手/README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"2_https和http/README.md","mtime":"2021-03-17T00:39:23.696Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-03-17T02:15:43.632Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

